{
    "INTJ": {
        "intro_pars": [
            "An Architect (INTJ) is a person with the Introverted, Intuitive, Thinking, and Judging personality traits. These thoughtful tacticians love perfecting the details of life, applying creativity and rationality to everything they do. Their inner world is often a private, complex one.",
            "It can be lonely at the top. As one of the rarest personality types – and one of the most capable – Architects (INTJs) know this all too well. Rational and quick-witted, Architects pride themselves on their ability to think for themselves, not to mention their uncanny knack for seeing right through phoniness and hypocrisy. But because their minds are never at rest, Architects may struggle to find people who can keep up with their nonstop analysis of everything around them."
        ],
        "intro_sections": {
            "A Pioneering Spirit": [
                "Architects question everything. Many personality types trust the status quo, relying on conventional wisdom and other people’s expertise to guide their lives. But ever-skeptical Architects prefer to make their own discoveries. In their quest to find better ways of doing things, they aren’t afraid to break the rules or risk disapproval – in fact, they rather enjoy it.",
                "But as anyone with this personality type would tell you, a new idea isn’t worth anything unless it actually works. Architects want to be successful, not just inventive. They bring a single-minded drive to their work, applying the full force of their insight, logic, and willpower. And heaven help anyone who tries to slow them down by enforcing pointless rules or offering poorly thought-out criticism.",
                "This personality type comes with a strong independent streak. Architects don’t mind acting alone, perhaps because they don’t like waiting around for others to catch up with them. They also generally prefer making decisions without asking for anyone else’s input. At times, this lone-wolf behavior can come across as insensitive, as it fails to take into consideration other people’s thoughts, desires, and plans.",
                "It would be a mistake, however, to view Architects as uncaring. Whatever the stereotypes about their stoic intellect, these personalities feel deeply. When things go wrong or when they hurt others, Architects are personally affected and spend much time and energy trying to figure out why things happened the way that they did. They may not always value emotion as a decision-making tool, but they are authentically human."
            ],
            "A Thirst for Knowledge": [
                "Architects can be both the boldest of dreamers and the bitterest of pessimists. They believe that, through willpower and intelligence, they can achieve even the most challenging goals. But these personalities may be cynical about human nature more generally, assuming that most people are lazy, unimaginative, or simply doomed to mediocrity.",
                "People with the Architect personality type derive much of their self-esteem from their knowledge and mental acuity. In school, they may have been called “bookworms” or “nerds.” But rather than taking these labels as insults, many Architects embrace them. They recognize their own ability to teach themselves about – and master – any topic that interests them, whether that’s coding or capoeira or classical music.",
                "Architects can be single-minded, with little patience for frivolity, distractions, or idle gossip. That said, they’re far from dull or humorless. Many Architects are known for their irreverent wit, and beneath their serious exteriors, they often have a sharp, delightfully sarcastic sense of humor."
            ],
            "Social Frustrations": [
                "Architects aren’t known for being warm and fuzzy. They tend to prioritize rationality and success over politeness and pleasantries – in other words, they’d rather be right than popular. This may explain why so many fictional villains are modeled on this personality type.",
                "Because Architects value truth and depth, many common social practices – from small talk to white lies – may seem pointless or downright stupid to them. As a result, they may inadvertently come across as rude or even offensive when they’re only trying to be honest.",
                "But like any personality type, Architects do crave social interaction – they’d just prefer to surround themselves with people who share their values and priorities. Often, they can achieve this just by being themselves. When Architects pursue their interests, their natural confidence can draw people to them – professionally, socially, and even romantically."
            ],
            "The Chess Game of Life": [
                "Architects are full of contradictions. They are imaginative yet decisive, ambitious yet private, and curious yet focused. From the outside, these contradictions may seem baffling, but they make perfect sense once you understand the inner workings of the Architect mind.",
                "For these personalities, life is like a giant game of chess. Relying on strategy rather than chance, Architects contemplate the strengths and weaknesses of each move before they make it. And they never lose faith that, with enough ingenuity and insight, they can find a way to win – no matter what challenges might arise along the way."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Friedrich_Nietzsche.png",
                "name": "Friedrich Nietzsche",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michelle_Obama.png",
                "name": "Michelle Obama",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Elon_Musk.png",
                "name": "Elon Musk",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Christopher_Nolan.png",
                "name": "Christopher Nolan",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Arnold_Schwarzenegger.png",
                "name": "Arnold Schwarzenegger",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Colin_Powell.png",
                "name": "Colin Powell",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Samantha_Power.png",
                "name": "Samantha Power",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Walter_White_(u201cHeisenbergu201d).png",
                "name": "Walter White (u201cHeisenbergu201d)",
                "fictional": 1,
                "movie": "Breaking Bad",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Petyr_Baelish_(u201cLittlefingeru201d).png",
                "name": "Petyr Baelish (u201cLittlefingeru201d)",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tywin_Lannister.png",
                "name": "Tywin Lannister",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Yennefer_of_Vengerberg.png",
                "name": "Yennefer of Vengerberg",
                "fictional": 1,
                "movie": "The Witcher series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Gandalf_the_Grey.png",
                "name": "Gandalf the Grey",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": "/articles/gandalf-a-calculating-wizard-the-lord-of-the-rings-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Professor_Moriarty.png",
                "name": "Professor Moriarty",
                "fictional": 1,
                "movie": "Sherlock Holmes series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Katniss_Everdeen.png",
                "name": "Katniss Everdeen",
                "fictional": 1,
                "movie": "The Hunger Games",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Seven_of_Nine.png",
                "name": "Seven of Nine",
                "fictional": 1,
                "movie": "Star Trek: Voyager",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jay_Gatsby.png",
                "name": "Jay Gatsby",
                "fictional": 1,
                "movie": "The Great Gatsby",
                "article": "/articles/gatsbys-personality-type-a-boat-against-the-current"
            }
        ],
        "strengths": {
            "strengths": {
                "Rational": {
                    "image": "./assets/strength_weaknesses/001-thinking.png",
                    "description": "Architects pride themselves on the power of their minds. They can reframe nearly any challenge as an opportunity to hone their rational thinking skills and expand their knowledge – and with this mindset, they can devise inventive solutions to even the most arduous of problems."
                },
                "Informed": {
                    "image": "./assets/strength_weaknesses/002-list.png",
                    "description": "Few personality types are as devoted as Architects to developing rational, correct, and evidence-based opinions. Rather than hunches or half-baked assumptions, they base their conclusions on research and analysis. This gives them the conviction that they need to stand up for their ideas, even in the face of disagreement."
                },
                "Independent": {
                    "image": "./assets/strength_weaknesses/003-goal.png",
                    "description": "For these personalities, conformity is more or less synonymous with mediocrity. Creative and self-motivated, Architects strive to do things their own way. They can imagine few things more frustrating than allowing arbitrary rules or conventions to stand in the way of their success."
                },
                "Determined": {
                    "image": "./assets/strength_weaknesses/004-motivation.png",
                    "description": "This personality type is known for being ambitious and goal-oriented. Architects won’t rest until they’ve achieved their own definition of success – which usually entails mastering the subjects and pursuits that matter to them."
                },
                "Curious": {
                    "image": "./assets/strength_weaknesses/005-question.png",
                    "description": "Architects are open to new ideas – as long as those ideas are rational and evidence-based, that is. Skeptical by nature, Architects are especially drawn to offbeat or contrarian points of view. And if the facts prove them wrong, they are generally happy to revise their opinions."
                },
                "Original": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Without Architects, the world would be a far less interesting place. This personality type’s rebellious streak is responsible for some of history’s most unconventional ideas and inventions. Even in their everyday lives, Architects force the people around them to consider new (and sometimes startling) ways of looking at things."
                }
            },
            "weaknesses": {
                "Arrogant": {
                    "image": "./assets/strength_weaknesses/011-introvert-1.png",
                    "description": "Architects might be knowledgeable, but they’re not infallible. Their self-assurance can blind them to useful input from other people – especially anyone they deem to be intellectually inferior. These personalities can also come across as needlessly harsh or single-minded in trying to prove others wrong."
                },
                "Dismissive of Emotions": {
                    "image": "./assets/strength_weaknesses/07-bad.png",
                    "description": "For Architects, rationality is king. But emotional context often matters more than people with this personality type care to admit. Architects can get impatient with anyone who seems to value feelings more than facts. Unfortunately, ignoring emotion is its own type of bias – one that can cloud Architects’ judgment."
                },
                "Overly Critical": {
                    "image": "./assets/strength_weaknesses/008-warning.png",
                    "description": "These personalities tend to have a great deal of self-control, particularly when it comes to thoughts and feelings. When the people in their lives fail to match their level of restraint, Architects can appear scathingly critical. But this criticism can be unfair, based on arbitrary standards rather than a full understanding of human nature."
                },
                "Combative": {
                    "image": "./assets/strength_weaknesses/009-boxing-gloves.png",
                    "description": "Architects hate blindly following anything without understanding why. This includes restrictions and the authority figures who impose them. People with this personality type can get caught up in arguing about useless rules and regulations – but sometimes these battles are distractions from more important matters."
                },
                "Socially Clueless": {
                    "image": "./assets/strength_weaknesses/010-introvert.png",
                    "description": "Architects’ relentless rationality can lead to frustration in their social lives. Their efforts to defy expectations may leave them feeling isolated or disconnected from other people. At times, they may become cynical about the value of relationships altogether, questioning the importance of love and connection."
                }
            }
        },
        "friendships_sections": {
            "An Intellectual Match": [
                "It’s not always easy to befriend an Architect. People with this personality type have little patience for social rules or expectations, and they’d rather spend time alone than with someone who bores or irritates them. Architects tend to have a clear idea of what they expect from their social lives and their friends, and they don’t want to waste too much time on anyone who doesn’t seem to meet these expectations.",
                "From the outside, this might sound dismissive, but the truth is that many Architects have a knack for finding friends in seemingly unlikely places. These personalities aren’t particularly swayed by appearances or social status, so they aren’t afraid to befriend people who might be thought of as “outsiders” by the mainstream. In sizing up a potential friend, Architects don’t particularly care how popular that person is – instead, they consider whether that person has values that are compatible with their own, such as intellect, honesty, self-improvement, or simply a different perspective.",
                "In friendship, Architects are looking for an intellectual match as much as anything else. These personalities crave mental stimulation, and they tend to have the most fun among friends who can challenge their ideas, expose them to new concepts, and steer conversations in unexpected directions."
            ],
            "A Unique Friendship": [
                "In their friendships, as in other aspects of their lives, Architects prize independence. Social obligations can feel stifling to people with this personality type. Architects don’t want to feel beholden to their friends, and they don’t want their friends to feel beholden to them. For them, an ideal friendship is low drama, based on true enjoyment of each other’s company rather than obligation.",
                "Of course, any long-term friendship will have its dramatic moments. When sensitive or emotional situations arise, Architects may feel out of their depth. Architects are used to feeling knowledgeable and capable, and this sudden cluelessness can be disorienting for them. Many people with this personality type have to practice listening to their friends in a nonjudgmental, supportive way rather than jumping in immediately with solutions and advice.",
                "The good news is that, among friends they know and respect, Architects have no trouble relaxing and being themselves. Architects’ sarcasm and witty banter may not be for everyone – especially people who struggle to read between the lines. But these personalities reward their true friends with candor and insight, along with an endless supply of fascinating stories, ideas, and conversations."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/intj-architect.svg?v=2",
            "phrase": "Imaginative and strategic thinkers, with a plan for everything.",
            "link": "https://www.16personalities.com/intj-personality",
            "type": "Architect"
        }
    },
    "INTP": {
        "intro_pars": [
            "A Logician (INTP) is someone with the Introverted, Intuitive, Thinking, and Prospecting personality traits. These flexible thinkers enjoy taking an unconventional approach to many aspects of life. They often seek out unlikely paths, mixing willingness to experiment with personal creativity.",
            "Logicians pride themselves on their unique perspectives and vigorous intellect. They can’t help but puzzle over the mysteries of the universe – which may explain why some of the most influential philosophers and scientists of all time have been Logicians. This personality type is fairly rare, but with their creativity and inventiveness, Logicians aren’t afraid to stand out from the crowd."
        ],
        "intro_sections": {
            "The Life of the Mind": [
                "Logicians often lose themselves in thought – which isn’t necessarily a bad thing. People with this personality type hardly ever stop thinking. From the moment they wake up, their minds buzz with ideas, questions, and insights. At times, they may even find themselves conducting full-fledged debates in their own heads.",
                "From the outside, Logicians may seem to live in a never-ending daydream. They have a reputation for being pensive, detached, and a bit reserved. That is, until they try to train all of their mental energy on the moment or the person at hand, which can be a bit uncomfortable for everyone. But regardless of which mode they’re in, Logicians are Introverts and tend to get tired out by extensive socializing. After a long day, they crave time alone to consult their own thoughts.",
                "But it would be a mistake to think that Logicians are unfriendly or uptight. When they connect with someone who can match their mental energy, these personalities absolutely light up, leaping from one thought to another. Few things energize them like the opportunity to swap ideas or enjoy a lively debate with another curious, inquiring soul."
            ],
            "Elementary, My Dear Logician": [
                "Logicians love to analyze patterns. Without necessarily knowing how they do it, people with this personality type often have a Sherlock Holmes–like knack for spotting discrepancies and irregularities. In other words, it’s a bad idea to lie to them.",
                "Ironically, Logicians shouldn’t always be held at their word. They rarely mean to be dishonest, but with their active minds, they sometimes overflow with ideas and theories that they haven’t thought through all the way. They may change their mind on anything from their weekend plans to a fundamental moral principle, without ever realizing that they’d appeared to have made up their mind in the first place. In addition, they are often happy to play devil’s advocate in order to keep an interesting discussion humming along.",
                "Logicians could spend all day musing about ideas and possibilities – and they often do. That said, the practical, everyday work of turning those ideas into reality doesn’t always hold their interest. Fortunately, when it comes to dissecting a tricky, multilayered problem and coming up with a creative solution, few personality types can match Logicians’ creative genius and potential."
            ],
            "Mysteries of the Universe": [
                "People with this personality type want to understand everything in the universe, but one area in particular tends to mystify them: human nature. As their name suggests, Logicians feel most at home in the realm of logic and rationality. As a result, they can find themselves baffled by the illogical, irrational ways that feelings and emotions influence people’s behavior – including their own.",
                "This doesn’t mean that Logicians are unfeeling. These personalities generally want to offer emotional support to their friends and loved ones, but they don’t necessarily know how. And because they can’t decide on the best, most efficient way to offer support, they may hold off on doing or saying anything at all.",
                "This “analysis paralysis” can affect multiple areas of Logicians’ lives. People with this personality type can overthink even the smallest of decisions. This makes them feel ineffective and stuck, so exhausted by the endless parade of thoughts in their mind that they struggle to get things done.",
                "The good news is that Logicians don’t have to stay stuck for long. Their unique strengths include everything they need to pull themselves out of the ruts that they occasionally fall into. By leveraging their creativity and their open-mindedness, Logicians can reach their full potential – both as thinkers and as happy, well-rounded people."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Bill_Gates.png",
                "name": "Bill Gates",
                "fictional": 0,
                "movie": "",
                "article": "/articles/bill-gates-assertive-logician-intp-a"
            },
            {
                "avatar": "./assets/celebrities/Kristen_Stewart.png",
                "name": "Kristen Stewart",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Albert_Einstein.png",
                "name": "Albert Einstein",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Avicii.png",
                "name": "Avicii",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Stanley_Crouch.png",
                "name": "Stanley Crouch",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Isaac_Newton.png",
                "name": "Isaac Newton",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Rene_Descartes.png",
                "name": "Rene Descartes",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Elliot_Page.png",
                "name": "Elliot Page",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Blaise_Pascal.png",
                "name": "Blaise Pascal",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lord_Varys.png",
                "name": "Lord Varys",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Neo.png",
                "name": "Neo",
                "fictional": 1,
                "movie": "The Matrix",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Marshall_Flinkman.png",
                "name": "Marshall Flinkman",
                "fictional": 1,
                "movie": "Alias",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Bruce_Banner.png",
                "name": "Bruce Banner",
                "fictional": 1,
                "movie": "Avengers",
                "article": "/articles/bruce-bannerthe-hulk-the-super-turbulent-logician-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Aemon_Targaryen.png",
                "name": "Aemon Targaryen",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Leslie_Winkle.png",
                "name": "Leslie Winkle",
                "fictional": 1,
                "movie": "The Big Bang Theory",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Chloe_Ou2019Brian.png",
                "name": "Chloe Ou2019Brian",
                "fictional": 1,
                "movie": "24",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Alexander_Mahone.png",
                "name": "Alexander Mahone",
                "fictional": 1,
                "movie": "Prison Break",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Abed_Nadir.png",
                "name": "Abed Nadir",
                "fictional": 1,
                "movie": "Community",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jack_Ryan.png",
                "name": "Jack Ryan",
                "fictional": 1,
                "movie": "Jack Ryan series",
                "article": "/articles/jack-ryans-personality-type-the-power-of-analysis"
            }
        ],
        "strengths": {
            "strengths": {
                "Analytical ": {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description": "Logicians analyze everything that they come across, from research data to the behavior of the people around them. This gives them a knack for spotting unexpected patterns and connections that other personality types might overlook."
                },
                "Original ": {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description": "Thanks to their unrelenting imagination, Logicians can come up with creative, counterintuitive ideas that wouldn’t occur to most people. Not all of these ideas are feasible, of course, but Logicians’ willingness to think outside the box can produce remarkable innovations."
                },
                "Open-Minded": {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description": "Logicians are driven by curiosity and an intense desire to learn everything that they can. People with this personality type tend to be receptive to new ideas and ways of doing things – as long as those ideas are supported by sound reasoning."
                },
                "Curious ":  {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description":"These personalities are always casting about for new pursuits, hobbies, and areas of research. One week, they might be obsessed with geophysics, and the next, they might lose themselves in videos about guitar building. When inspiration strikes, Logicians go all in on their newfound interest, learning everything that they can."
                },
                "Objective ":  {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description":"Logicians care about the truth. Rather than taking comfort in ideology or received ideas, they want to understand what’s really going on beneath the surface of things. As a result, they can be relied upon to combat bias and misinformation, even when it isn’t easy to do so – and they expect other people to be honest with them in return."
                }
            },
            "weaknesses": {
                "Disconnected ":  {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description":"Logicians can get lost in their own train of thought, even when they’re with other people. When these personalities finally resurface with something to say, they may find that the conversation has moved on without them. This can cause them to feel disconnected from other people, especially in large social gatherings."
                },"Insensitive ": {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description": "People with this personality type see rationality as the key to a better, happier world. At times, they may underestimate the importance of such irrational values as emotion, compassion, etiquette, and tradition. As a result, they may inadvertently come across as insensitive or unkind, even though their intentions are generally good."
                },"Dissatisfied ": {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description": "Logicians can’t help but imagine how things could be better than they already are. These personalities are constantly on the lookout for problems to solve, topics to learn, and new ways to approach things. Taken too far, this mindset can become overwhelming, with Logicians constantly trying to reinvent the wheel rather than reliably addressing their needs and responsibilities."
                },"Impatient ":  {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description":"Logicians take pride in their knowledge and in sharing their ideas. When it comes to explaining their rationale, however, they aren’t always patient. If their conversation partner doesn’t follow along or seem sufficiently interested, Logicians may give up with a dismissive “never mind.”"
                },
                  "Perfectionistic ":  {
                    "image":  "./assets/strength_weaknesses/001-thinking.png",
                    "description":"Logicians want to get things done, but their quest for perfection can get in the way. At times, these personalities may get so lost in analyzing various options that they never reach a decision. They may also give up on projects that don’t match the ideal vision in their mind."
                }
            }
        },
        "friendships_sections": {
            "Choosy or Selective?": [
                "Perhaps because they don’t mind the company of their own thoughts, Logicians don’t surround themselves with people just for the sake of it. As a result, it’s not always easy to become close friends with these personalities. But when Logicians do open up, they can be lively, imaginative friends who always have something interesting or unexpected to say.",
                "Logicians’ best friends tend to share their passion for new ideas, riddles, and solutions. But that doesn’t mean that people with this personality type only seek out friends who agree with them. Logicians don’t mind having their ideas challenged – in fact, they have a great deal of respect for people who make them rethink their assumptions and keep them on their toes.",
                "Logician friendships are knowledge-based, buoyed by the exchange of ideas, theories, and concepts. People who aren’t able to keep up or who have sharply differing tastes (don’t talk to Logicians about celebrities) may find themselves feeling ignored or brushed off. Logicians reserve conversation for topics that they find meaningful or for people they already like enough to stick it out."
            ],
            "The Meaning of Friendship": [
                "When friends come to them with problems and dilemmas, Logicians are generally excited to help. They can be counted on to offer logical advice and rational solutions, turning even the messiest of situations into a pros-and-cons list.",
                "But when it comes to emotional support or matters of the heart, people with this personality type may feel a bit out of their depth. For Logicians, one of the greatest (and most difficult) lessons of friendship is that sometimes people don’t need advice on how to solve their problems – they just need someone they can count on to be by their side.",
                "Over time, many Logicians learn that lively conversations and all-night brainstorming sessions may be fun, but they’re not all that friendship is about. These personalities have an uncanny ability to see past superficial trappings, such as social status or how someone dresses, and appreciate the full potential of the person inside. In a world obsessed with fitting in, Logicians can inspire their friends to buck convention, ignore trends, and find their unique voices."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/intp-logician.svg?v=2",
            "phrase": "Innovative inventors with an unquenchable thirst for knowledge.",
            "link": "https://www.16personalities.com/intp-personality",
            "type": "Logician"
        }
    },
    "ENTJ": {
        "intro_pars": [
            "A Commander (ENTJ) is someone with the Extraverted, Intuitive, Thinking, and Judging personality traits. They are decisive people who love momentum and accomplishment. They gather information to construct their creative visions but rarely hesitate for long before acting on them.",
            "Commanders are natural-born leaders. People with this personality type embody the gifts of charisma and confidence, and project authority in a way that draws crowds together behind a common goal. However, Commanders are also characterized by an often ruthless level of rationality, using their drive, determination and sharp minds to achieve whatever end they’ve set for themselves. Perhaps it is best that they make up only three percent of the population, lest they overwhelm the more timid and sensitive personality types that make up much of the rest of the world – but we have Commanders to thank for many of the businesses and institutions we take for granted every day."
        ],
        "intro_sections": {
            "Striving for Greatness": [
                "If there’s anything Commanders love, it’s a good challenge, big or small, and they firmly believe that given enough time and resources, they can achieve any goal. This quality makes people with the Commander personality type brilliant entrepreneurs, and their ability to think strategically and hold a long-term focus while executing each step of their plans with determination and precision makes them powerful business leaders. This determination is often a self-fulfilling prophecy, as Commanders push their goals through with sheer willpower where others might give up and move on, and their Extraverted (E) nature means they are likely to push everyone else right along with them, achieving spectacular results in the process.",
                "At the negotiating table, be it in a corporate environment or buying a car, Commanders are dominant, relentless, and unforgiving. This isn’t because they are coldhearted or vicious per se – it’s more that Commander personalities genuinely enjoy the challenge, the battle of wits, the repartee that comes from this environment, and if the other side can’t keep up, that’s no reason for Commanders to fold on their own core tenet of ultimate victory.",
                "If there’s anyone Commanders respect, it’s someone who is able to stand up to them intellectually, who is able to act with a precision and quality equal to their own. Commander personalities have a particular skill in recognizing the talents of others, and this helps in both their team-building efforts (since no one, no matter how brilliant, can do everything alone), and to keep Commanders from displaying too much arrogance and condescension. However, they also have a particular skill in calling out others’ failures with a chilling degree of insensitivity, and this is where Commanders really start to run into trouble."
            ],
            "A Worthy Challenge": [
                "Emotional expression isn’t the strong suit of any Analyst type, but Commanders’ distance from their emotions is especially public, and felt directly by a much broader swath of people. Especially in a professional environment, Commanders will simply crush the sensitivities of those they view as inefficient, incompetent or lazy. To people with the Commander personality type, emotional displays are displays of weakness, and it’s easy to make enemies with this approach – Commanders will do well to remember that they absolutely depend on having a functioning team, not just to achieve their goals, but for their validation and feedback as well, something Commanders are, curiously, very sensitive to.",
                "Commanders are true powerhouses, and they cultivate an image of being larger than life – and often enough they are. They need to remember though, that their stature comes not just from their own actions, but from the actions of the team that props them up, and that it’s important to recognize the contributions, talents and needs, especially from an emotional perspective, of their support network. Even if they have to adopt a \"fake it ‘til you make it\" mentality, if Commanders are able to combine an emotionally healthy focus alongside their many strengths, they will be rewarded with deep, satisfying relationships and all the challenging victories they can handle."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Steve_Jobs.png",
                "name": "Steve Jobs",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Gordon_Ramsay.png",
                "name": "Gordon Ramsay",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Margaret_Thatcher.png",
                "name": "Margaret Thatcher",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Franklin_D._Roosevelt.png",
                "name": "Franklin D. Roosevelt",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jim_Carrey.png",
                "name": "Jim Carrey",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Whoopi_Goldberg.png",
                "name": "Whoopi Goldberg",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Harrison_Ford.png",
                "name": "Harrison Ford",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Malcolm_X.png",
                "name": "Malcolm X",
                "fictional": 0,
                "movie": "",
                "article": "/articles/malcolm-x-growing-into-a-commander"
            },
            {
                "avatar": "./assets/celebrities/Doctor_Strange.png",
                "name": "Doctor Strange",
                "fictional": 1,
                "movie": "Doctor Strange",
                "article": "/articles/doctor-strange-the-rational-mystic-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Tony_Soprano.png",
                "name": "Tony Soprano",
                "fictional": 1,
                "movie": "The Sopranos",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/David_Palmer.png",
                "name": "David Palmer",
                "fictional": 1,
                "movie": "24",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Malcolm_Merlyn.png",
                "name": "Malcolm Merlyn",
                "fictional": 1,
                "movie": "Arrow",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Mary_Talbot.png",
                "name": "Mary Talbot",
                "fictional": 1,
                "movie": "Downton Abbey",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Francis_J._Underwood.png",
                "name": "Francis J. Underwood",
                "fictional": 1,
                "movie": "House of Cards",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jacqueline_A._Sharp.png",
                "name": "Jacqueline A. Sharp",
                "fictional": 1,
                "movie": "House of Cards",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/River_Tam.png",
                "name": "River Tam",
                "fictional": 1,
                "movie": "Firefly",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Milady_de_Winter.png",
                "name": "Milady de Winter",
                "fictional": 1,
                "movie": "The Three Musketeers",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Miranda_Priestly.png",
                "name": "Miranda Priestly",
                "fictional": 1,
                "movie": "The Devil Wears Prada",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Raymond_Reddington.png",
                "name": "Raymond Reddington",
                "fictional": 1,
                "movie": "The Blacklist",
                "article": ""
            }
        ],
        
            "strengths": {
              "strengths": {
                "Efficient": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Commanders see inefficiency not just as a problem in its own right, but as something that pulls time and energy away from all their future goals, an elaborate sabotage consisting of irrationality and laziness. People with the Commander personality type will root out such behavior wherever they go."
                },
                "Energetic": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Rather than finding this process taxing Commanders are energized by it, genuinely enjoying leading their teams forward as they implement their plans and goals."
                },
                "Self-Confident": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Commanders couldn't do this if they were plagued by self-doubt – they trust their abilities, make known their opinions, and believe in their capacities as leaders."
                },
                "Strong-Willed": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Nor do they give up when the going gets tough – Commander personalities strive to achieve their goals, but really nothing is quite as satisfying to them as rising to the challenge of each obstacle in their run to the finish line."
                },
                "Strategic Thinkers": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Commanders exemplify the difference between moment-to-moment crisis management and navigating the challenges and steps of a bigger plan, and are known for examining every angle of a problem and not just resolving momentary issues, but moving the whole project forward with their solutions."
                },
                "Charismatic and Inspiring": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "These qualities combine to create individuals who are able to inspire and invigorate others, who people actually want to be their leaders, and this in turn helps Commanders to accomplish their often ambitious goals that could never be finished alone."
                }
              },
              "weaknesses": {
                "Stubborn and Dominant": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Sometimes all this confidence and willpower can go too far, and Commanders are all too capable of digging in their heels, trying to win every single debate and pushing their vision, and theirs alone."
                },
                "Intolerant": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "“It's my way or the highway” – People with the Commander personality type are notoriously unsupportive of any idea that distracts from their primary goals, and even more so of ideas based on emotional considerations. Commanders won't hesitate a second to make that fact clear to those around them."
                },
                "Impatient": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Some people need more time to think than others, an intolerable delay to quick-thinking Commanders. They may misinterpret contemplation as stupidity or disinterest in their haste, a terrible mistake for a leader to make."
                },
                "Arrogant": {
                  "image": "./assets/strength_weaknesses/006-original.png",
                  "description": "Commander personalities respect quick thoughts and firm convictions, their own qualities, and look down on those who don't match up. This relationship is a challenge for most other personality types who are perhaps not timid in their own right, but will seem so beside overbearing Commanders."
                },
                "Poor Handling of Emotions": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "All this bluster, alongside the assumed supremacy of rationalism, makes Commanders distant from their own emotional expression and sometimes downright scornful of others'. People with this personality type often trample others' feelings, inadvertently hurting their partners and friends, especially in emotionally charged situations."
                },
                "Cold and Ruthless": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Their obsession with efficiency and unwavering belief in the merits of rationalism, especially professionally, makes Commanders incredibly insensitive in pursuing their goals, dismissing personal circumstances, sensitivities, and preferences as irrational and irrelevant."
                }
            }   
        },                         
                
        "friendships_sections": {
            "Bridging the Gap": [
                "More enlightened Commanders recognize that if ever there was an area where they could learn from others and improve themselves, it is in the realm of emotional sensitivity – to dismiss any aspect of personal growth borders on hypocrisy. Friendships with people from the Diplomat type group can be especially rewarding for Commanders, as the shared Intuitive (N) trait fosters an instantaneous connection that can bridge the chasm between their uninhibited logic and the recognition that cooperation and conciliation can often accomplish more than that logic ever could alone.",
                "Still, the bulk of Commanders’ friends will likely fall into the Analyst category, as all of these types share the same passion for logical, far-reaching ideas and critical debate. Anyone who can match Commanders’ ability to brainstorm and theorize will find an honest and dedicated friend. Anyone who can’t or won’t, as with many more down-to-earth types who often question the point of such discussions, will find themselves ignored – perhaps a situation that is best for everyone."
            ]
        },

        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/entj-commander.svg?v=2",
            "phrase": "Bold, imaginative and strong-willed leaders, always finding a way – or making one.",
            "link": "https://www.16personalities.com/entj-personality",
            "type": "Commander"
        }
    },
    "ENTP": {
        "intro_pars": [
            "A Debater (ENTP) is a person with the Extraverted, Intuitive, Thinking, and Prospecting personality traits. They tend to be bold and creative, deconstructing and rebuilding ideas with great mental agility. They pursue their goals vigorously despite any resistance they might encounter.",
            "Quick-witted and audacious, Debaters aren’t afraid to disagree with the status quo. In fact, they’re not afraid to disagree with pretty much anything or anyone. Few things light up people with this personality type more than a bit of verbal sparring – and if the conversation veers into controversial terrain, so much the better.",
            "It would be a mistake, though, to think of Debaters as disagreeable or mean-spirited. Instead, people with this personality type are knowledgeable and curious, with a playful sense of humor, and they can be incredibly entertaining. They simply have an offbeat, contrarian idea of fun – one that involves a healthy dose of spirited debate."
        ],
        "intro_sections": {
            "Breaking the Rules": [
                "Debaters are known for their rebellious streak. For this personality type, no belief is too sacred to be questioned, no idea is too fundamental to be scrutinized, and no rule is too important to be broken, or at least thoroughly tested. Sometimes Debaters even rebel against their own beliefs by arguing the opposing viewpoint – just to see how the world looks from the other side.",
                "As Debaters see it, most people are too ready to do as they’re told and blindly conform to social norms, pressures, and standards. Debaters enjoy the mental exercise of questioning the prevailing mode of thought, and they take a certain pleasure in uncovering the value of underdogs and outliers. Their active minds can’t help but rethink the things that everyone else takes for granted and push them in clever new directions.",
                "While Debater personalities love to brainstorm and think big, they tend to avoid getting caught doing the “grunt work” of implementing their ideas. To some extent, this makes sense – Debaters have far too many thoughts and suggestions to keep track of them all, let alone turn them into reality. But unless Debaters develop the willingness to identify and actually follow through on their priorities, they may struggle to harness their full potential."
            ],
            "The Cost of Contrarianism": [
                "Debaters’ capacity for debate is legendary, but that doesn’t mean that it’s always helpful. When they openly question their boss in a meeting or pick apart everything their significant other says, Debaters may think that they’re being champions of rationality and logic. But they may also be doing their chances of success and happiness more harm than good.",
                "Not every occasion calls for this personality type’s default contrarianism, and most people can only stand to have their beliefs questioned and their feelings brushed aside for so long. As a result, Debaters may find that their quarrelsome fun burns many bridges, often inadvertently. Debaters are respected for their vision, confidence, knowledge, and keen sense of humor – but unless they cultivate a bit of sensitivity, they may struggle to maintain deeper relationships or even to achieve their professional goals.",
                "With time, many Debaters realize that their ideal life involves other people and that spending too much energy on “winning” arguments ultimately means robbing themselves of the support that they need to get where they want to be in life. The good news is that people with this personality type will never lose their sharply nonconformist edge. They can simply use their cognitive flexibility to understand and explore other people’s perspectives, recognizing the value of consideration and compromise alongside logic and progress."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Alfred_u201cWeird_Alu201d_Yankovic.png",
                "name": "Alfred u201cWeird Alu201d Yankovic",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Adam_Savage.png",
                "name": "Adam Savage",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Sarah_Silverman.png",
                "name": "Sarah Silverman",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Mark_Twain.png",
                "name": "Mark Twain",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tom_Hanks.png",
                "name": "Tom Hanks",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Thomas_Edison.png",
                "name": "Thomas Edison",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Cu00e9line_Dion.png",
                "name": "Cu00e9line Dion",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Sacha_Baron_Cohen.png",
                "name": "Sacha Baron Cohen",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Captain_Jack_Sparrow.png",
                "name": "Captain Jack Sparrow",
                "fictional": 1,
                "movie": "Pirates of the Caribbean",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tyrion_Lannister.png",
                "name": "Tyrion Lannister",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Irene_Adler.png",
                "name": "Irene Adler",
                "fictional": 1,
                "movie": "Sherlock Holmes series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/The_Joker.png",
                "name": "The Joker",
                "fictional": 1,
                "movie": "Batman series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jim_Halpert.png",
                "name": "Jim Halpert",
                "fictional": 1,
                "movie": "The Office",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Dr._Emmett_Brown.png",
                "name": "Dr. Emmett Brown",
                "fictional": 1,
                "movie": "Back to the Future",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Felicity_Smoak.png",
                "name": "Felicity Smoak",
                "fictional": 1,
                "movie": "Arrow",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Julian_Sark.png",
                "name": "Julian Sark",
                "fictional": 1,
                "movie": "Alias",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Mark_Watney.png",
                "name": "Mark Watney",
                "fictional": 1,
                "movie": "The Martian",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
              "Knowledgeable": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Debaters rarely pass up a good opportunity to learn something new, especially abstract concepts. This information isn't usually absorbed for any planned purpose as with dedicated studying, people with the Debater personality type just find it fascinating."
              },
              "Quick Thinkers": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Debaters have tremendously flexible minds, and are able to shift from idea to idea without effort, drawing on their accumulated knowledge to prove their points, or their opponents', as they see fit."
              },
              "Original": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Having little attachment to tradition, Debater personalities are able to discard existing systems and methods and pull together disparate ideas from their extensive knowledge base, with a little raw creativity to hold them together, to formulate bold new ideas. If presented with chronic, systemic problems and given rein to solve them, Debaters respond with unabashed glee."
              },
              "Excellent Brainstormers": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Nothing is quite as enjoyable to Debaters as analyzing problems from every angle to find the best solutions. Combining their knowledge and originality to splay out every aspect of the subject at hand, rejecting without remorse options that don't work and presenting ever more possibilities, Debaters are irreplaceable in brainstorming sessions."
              },
              "Charismatic": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "People with the Debater personality type have a way with words and wit that others find intriguing. Their confidence, quick thought and ability to connect disparate ideas in novel ways create a style of communication that is charming, even entertaining, and informative at the same time."
              },
              "Energetic": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "When given a chance to combine these traits to examine an interesting problem, Debaters can be truly impressive in their enthusiasm and energy, having no qualms with putting in long days and nights to find a solution."
              }
            },
            "weaknesses": {
              "Very Argumentative": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "If there's anything Debaters enjoy, it's the mental exercise of debating an idea, and nothing is sacred. More consensus-oriented personality types rarely appreciate the vigor with which Debater personalities tear down their beliefs and methods, leading to a great deal of tension."
              },
              "Insensitive": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Being so rational, Debaters often misjudge others' feelings and push their debates well past others' tolerance levels. People with this personality type don't really consider emotional points to be valid in such debates either, which magnifies the issue tremendously."
              },
              "Intolerant": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Unless people are able to back up their ideas in a round of mental sparring, Debaters are likely to dismiss not just the ideas but the people themselves. Either a suggestion can stand up to rational scrutiny or it's not worth bothering with."
              },
              "Can Find It Difficult to Focus": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "The same flexibility that allows Debaters to come up with such original plans and ideas makes them readapt perfectly good ones far too often, or even drop them entirely as the initial excitement wanes and newer thoughts come along. Boredom comes too easily for Debaters, and fresh thoughts are the solution, though not always a helpful one."
              },
              "Dislike Practical Matters": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Debaters are interested in what could be – malleable concepts like ideas and plans that can be adapted and debated. When it comes to hard details and day-to-day execution where creative flair isn't just unnecessary but actually counter-productive, Debater personalities lose interest, often with the consequence of their plans never seeing the light of day."
              }
            }
          },
          
        "friendships_sections": {
            "Never a Dull Moment": [
                "They know how to relax and have fun too, it’s just that “fun” to Debaters – a bottle of wine and a discussion about the causes of and solutions to the European migrant crisis – could be described as “an evening from hell” by many other personalities. But Debaters are a genial and enthusiastic personality type for the most part, and pretty much any situation that allows for conversation and a little wordplay is an enjoyable outing.",
                "Debaters are actually remarkably good at communicating with friends and acquaintances of other personality types. Their natural tendency to argue as effectively as possible means that Debaters are accustomed to communicating in other people’s language and frame of reference, and this translates well into normal conversation. Where people with the Debater personality type do have difficulty relating to others is in emotional expression, the Achilles’ heel of all Analyst types."
            ],
            "Emotions Dismissed": [
                "Being inclined to suppress their emotions and feelings, when Debaters are faced with a friend who, figuratively or literally, needs a shoulder to cry on, they have no clue how to handle the situation. They are perfectly willing and happy to offer a series of rational, reasonable solutions to the problem at hand, as Debaters do for any situation where a problem needs to be fixed, but they are certainly not known for their sensitivity or outward affection, no matter how intuitively they may understand another’s position.",
                "Worse is when Debater personalities try to turn these emotional situations into something they find more comfortable: a debate. Given how remarkably good Debaters are at arguing both sides of a point, they are remarkably bad at putting themselves in someone else’s shoes from an emotional standpoint. Debaters should avoid at all costs the temptation to turn a discussion about the causes of a friend’s recent breakup into competitive intellectual fodder.",
                "So long as everyone understands not to take their words too personally, anyone who isn’t afraid to discuss new ideas – and have them converted into so much confetti – is likely to find stimulating and thought-provoking friends in Debaters. It’s not a compatibility that clicks with everyone, but Debaters don’t really care about being liked by everyone anyways. As long as they get to alternate between being the sounding board and the megaphone, Debaters and their friends are bound to enjoy each other’s company for a long, long time."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/entp-debater.svg?v=2",
            "phrase": "Smart and curious thinkers who cannot resist an intellectual challenge.",
            "link": "https://www.16personalities.com/entp-personality",
            "type": "Debater"
        }
    },
    "INFJ": {
        "intro_pars": [
            "An Advocate (INFJ) is someone with the Introverted, Intuitive, Feeling, and Judging personality traits. They tend to approach life with deep thoughtfulness and imagination. Their inner vision, personal values, and a quiet, principled version of humanism guide them in all things.",
            "Advocates (INFJs) may be the rarest personality type of all, but they certainly leave their mark on the world. Idealistic and principled, they aren’t content to coast through life – they want to stand up and make a difference. For Advocate personalities, success doesn’t come from money or status but from seeking fulfillment, helping others, and being a force for good in the world.",
            "While they have lofty goals and ambitions, Advocates shouldn’t be mistaken for idle dreamers. People with this personality type care about integrity, and they’re rarely satisfied until they’ve done what they know to be right. Conscientious to the core, they move through life with a clear sense of their values, and they aim never to lose sight of what truly matters – not according to other people or society at large, but according to their own wisdom and intuition."
        ],
        "intro_sections": {
            "Seeking Purpose": [
                "Perhaps because their personality type is so uncommon, Advocates tend to carry around a sense – whether conscious or not – of being different from most people. With their rich inner lives and their deep, abiding desire to find their life purpose, they don’t always fit in with those around them. This isn’t to say that Advocates can’t enjoy social acceptance or close relationships – only that they sometimes feel misunderstood or at odds with the world.",
                "Fortunately, this sense of being out of step doesn’t diminish Advocates’ commitment to making the world a better place. Advocates are troubled by injustice, and they typically care more about altruism than personal gain. They often feel called to use their strengths – including creativity, imagination, and sensitivity – to uplift others and spread compassion.",
                "Many Advocates see helping others as their mission in life, and they’re always looking for ways to step in and speak up for what is right. People with this personality type also aspire to fix society’s deeper problems, in the hope that unfairness and hardship can become things of the past. At times, however, Advocates may focus so intently on their ideals that they don’t take adequate care of themselves – a pattern that can lead to stress and burnout."
            ],
            "Connecting with Others (and Themselves)": [
                "Advocates may be Introverted, but they value deep, authentic relationships with others. Few things bring these personalities as much joy as truly knowing another person – and being known in return. Advocates enjoy meaningful conversations far more than small talk, and they tend to communicate in a way that is warm and sensitive. This emotional honesty and insight can make a powerful impression on the people around them.",
                "Thoughtful and compassionate, Advocates pour a great deal of energy and care into their relationships. This doesn’t mean that they always feel appreciated in return. Advocates tend to act with great thought and care, and it can frustrate them when other people don’t recognize their good intentions. As a result, even constructive criticism may feel incredibly personal or hurtful to these personalities."
            ],
            "A Personal Mission": [
                "Many Advocates feel that their life has a unique purpose – a mission that they were put onto this earth to fulfill. For people with this personality type, one of the most rewarding aspects of life is seeking out this purpose – and then, once they’ve found it, striving to do it justice.",
                "When Advocates encounter inequity or unfairness, they rarely give up – instead, they consult their intuition and their compassion to find a solution. With their innate ability to balance the heart with the head, Advocates are hardwired to right the wrongs of the world, no matter how big or small. These personalities just need to remember that while they’re busy taking care of everyone else, they need to pause sometimes and take care of themselves as well."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Martin_Luther_King.png",
                "name": "Martin Luther King",
                "fictional": 0,
                "movie": "",
                "article": "/articles/remembering-martin-luther-king-jr-the-advocate"
            },
            {
                "avatar": "./assets/celebrities/Nelson_Mandela.png",
                "name": "Nelson Mandela",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Mother_Teresa.png",
                "name": "Mother Teresa",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Marie_Kondo.png",
                "name": "Marie Kondo",
                "fictional": 0,
                "movie": "",
                "article": "/articles/marie-kondos-personality-type-revealed-and-yes-it-sparks-joy"
            },
            {
                "avatar": "./assets/celebrities/Lady_Gaga.png",
                "name": "Lady Gaga",
                "fictional": 0,
                "movie": "",
                "article": "/articles/lady-gagas-personality-type-far-from-the-shallow"
            },
            {
                "avatar": "./assets/celebrities/Nicole_Kidman.png",
                "name": "Nicole Kidman",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Morgan_Freeman.png",
                "name": "Morgan Freeman",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Goethe.png",
                "name": "Goethe",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jon_Snow.png",
                "name": "Jon Snow",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/James_Wilson.png",
                "name": "James Wilson",
                "fictional": 1,
                "movie": "House M.D.",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Aragorn.png",
                "name": "Aragorn",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": "/articles/aragorn-a-kingly-servant-the-lord-of-the-rings-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Galadriel.png",
                "name": "Galadriel",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tom_Kirkman.png",
                "name": "Tom Kirkman",
                "fictional": 1,
                "movie": "Designated Survivor",
                "article": "/articles/tom-kirkman-personality-of-a-survivor"
            },
            {
                "avatar": "./assets/celebrities/Rose_Bukater.png",
                "name": "Rose Bukater",
                "fictional": 1,
                "movie": "Titanic",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Desmond_Hume.png",
                "name": "Desmond Hume",
                "fictional": 1,
                "movie": "Lost",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Aramis.png",
                "name": "Aramis",
                "fictional": 1,
                "movie": "The Three Musketeers",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michael_Scofield.png",
                "name": "Michael Scofield",
                "fictional": 1,
                "movie": "Prison Break",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Atticus_Finch.png",
                "name": "Atticus Finch",
                "fictional": 1,
                "movie": "To Kill A Mockingbird",
                "article": "/articles/atticus-finchs-personality-type-standing-up-for-whats-right"
            },
            {
                "avatar": "./assets/celebrities/Matthew_Murdock.png",
                "name": "Matthew Murdock",
                "fictional": 1,
                "movie": "Daredevil",
                "article": ""
            }
        ],
        
         "strengths": {
             "strengths": {
                 "Creative": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates aren't exactly like everyone else – and that's a wonderful thing. People with this personality type embrace their creative side, always on the lookout for opportunities to express themselves and think outside the box."
                 },
                 "Insightful": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "These personalities know all too well that appearances can be misleading. Advocates strive to move beyond superficiality and seek out the deeper truths in life. This can give them an almost uncanny ability to understand people's true motivations, feelings, and needs."
                 },
                 "Principled": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates tend to have strong beliefs and values, particularly when it comes to matters of ethics. When Advocates talk about topics close to their heart, their conviction and heartfelt idealism can inspire and persuade even the sternest of skeptics."
                 },
                 "Passionate": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates crave a sense of purpose in life. Rather than living on autopilot or sticking to the status quo, they want to chase after their ideals. This isn't a personality type that shies away from big dreams – in fact, Advocates are energized and impassioned by the beauty of their visions for the future."
                 },
                 "Altruistic": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "People with this personality type aren't happy to succeed at another person's expense. Advocates want to use their strengths for the greater good, and they rarely lose sight of how their words and actions might affect others. In their heart of hearts, they want to make the world a better place, starting with the people around them."
                 }
             },
             "weaknesses": {
                 "Sensitive to Criticism": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates aren't averse to feedback – that is, unless they believe that someone is challenging their most cherished principles or values. When it comes to the issues that are near and dear to them, people with this personality type can become defensive or dismissive."
                 },
                 "Reluctant to Open Up": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates value honesty and authenticity, but they're also private. They may find it difficult to open up and be vulnerable about their struggles, not wanting to burden someone else with their issues. Unfortunately, when Advocates don't ask for help, they may inadvertently hold themselves back or create distance in their relationships."
                 },
                 "Perfectionistic": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "The Advocate personality type is all but defined by idealism. While this is a wonderful quality in many ways, it doesn't always leave room for the messiness of real life. Advocates might find it difficult to appreciate their jobs, living situations, or relationships if they're continually fixating on imperfections and wondering whether they should be looking for something better."
                 },
                 "Avoiding the Ordinary": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates yearn to do extraordinary things with their lives. But it's hard to achieve anything extraordinary without breaking it down into small, manageable steps. Unless they translate their dreams into everyday routines and to-do lists, Advocates may struggle to turn their grand visions into reality."
                 },
                 "Prone to Burnout": {
                     "image": "./assets/strength_weaknesses/006-original.png",
                     "description": "Advocates' perfectionism and reserve leave them with few options for letting off steam. People with this personality type can exhaust themselves if they don't balance their drive to help others with necessary self-care and rest."
                 }
             }
         },
                        
        "friendships_sections": {
            "Searching for a Heart of Gold": [
                "Advocates are known for having great expectations – not just for themselves but also for their friendships. High on this list of expectations is authenticity. If Advocates have to be fake or tone themselves down to gain someone’s approval, then that person probably isn’t the best friend for them. And it’s hard for people with this personality type to respect someone who won’t be honest with them in return – let alone anyone who can’t be honest with themselves.",
                "Another expectation that Advocates bring to their friendships is mutual support and growth. Having fun together is wonderful, but for these personalities, it isn’t quite enough. Advocates want to surround themselves with friends who inspire them to learn and expand and improve themselves. For them, the surest way for two friends to deepen their bond is by helping each other move forward on their respective life missions.",
                "This is a tall order, and Advocates may feel that it’s difficult to meet the sort of friends they’re seeking. Because their personality type is so rare, Advocates may meet relatively few people who really remind them of themselves. As a result, they may worry that they need to settle for less-than-fulfilling friendships – or else accept being alone."
            ],
            "Loyalty and Authenticity": [
                "Fortunately, people with this personality type are more than capable of finding the types of friends they long to meet – they might just have to devote additional energy to it. Sometimes these friends may be hiding in plain sight, among acquaintances whom Advocates simply don’t know all that well. This personality type is known for having astute first impressions of other people, but even Advocates can miss the deeper potentials of the people they encounter on a daily basis. When they give these people a chance, Advocates may find that they share values and attitudes that make them compatible on a deeper level.",
                "Once they do find genuine friendships, Advocates make loyal, caring companions. At times they may even be surprised by the fierceness of the loyalty and devotion they feel toward their friends. Few situations in life bring out Advocates’ bravery and commitment quite like the opportunity to stand up for a friend who needs them.",
                "Ultimately, the only way to be counted among Advocates’ true friends is to be authentic, honest, and real. Over the years, Advocates may end up with just a few true friendships rather than a wide circle of casual acquaintances. But as long as those friendships are built on a richness of mutual understanding, Advocates wouldn’t have it any other way."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/infj-advocate.svg?v=2",
            "phrase": "Quiet and mystical, yet very inspiring and tireless idealists.",
            "link": "https://www.16personalities.com/infj-personality",
            "type": "Advocate"
        }
    },
    "INFP": {
        "intro_pars": [
            "A Mediator (INFP) is someone who possesses the Introverted, Intuitive, Feeling, and Prospecting personality traits. These rare personality types tend to be quiet, open-minded, and imaginative, and they apply a caring and creative approach to everything they do.",
            "Although they may seem quiet or unassuming, Mediators (INFPs) have vibrant, passionate inner lives. Creative and imaginative, they happily lose themselves in daydreams, inventing all sorts of stories and conversations in their minds. These personalities are known for their sensitivity – Mediators can have profound emotional responses to music, art, nature, and the people around them.",
            "Idealistic and empathetic, Mediators long for deep, soulful relationships, and they feel called to help others. But because this personality type makes up such a small portion of the population, Mediators may sometimes feel lonely or invisible, adrift in a world that doesn’t seem to appreciate the traits that make them unique."
        ],
        "intro_sections": {
            "The Gift of Empathy": [
                "Mediators share a sincere curiosity about the depths of human nature. Introspective to the core, they’re exquisitely attuned to their own thoughts and feelings, but they yearn to understand the people around them as well. Mediators are compassionate and nonjudgmental, always willing to hear another person’s story. When someone opens up to them or turns to them for comfort, they feel honored to listen and be of help.",
                "Empathy is among this personality type’s greatest gifts, but at times it can be a liability. The troubles of the world weigh heavily on Mediators’ shoulders, and these personalities can be vulnerable to internalizing other people’s negative moods or mindsets. Unless they learn to set boundaries, Mediators may feel overwhelmed by just how many wrongs there are that need to be set right."
            ],
            "Speaking Their Truth": [
                "Few things make Mediators more uneasy than pretending to be someone they aren’t. With their sensitivity and their commitment to authenticity, people with this personality type tend to crave opportunities for creative self-expression. It comes as no surprise, then, that many famous Mediators are poets, writers, actors, and artists. They can’t help but muse about the meaning and purpose of life, dreaming up all sorts of stories, ideas, and possibilities along the way.",
                "Through these imaginative landscapes, Mediators can explore their own inner nature as well as their place in the world. While this is a beautiful trait, these personalities sometimes show a tendency to daydream and fantasize rather than take action. To avoid feeling frustrated, unfulfilled, or incapable, Mediators need to make sure that they take steps to turn their dreams and ideas into reality."
            ],
            "In Search of a Calling": [
                "People with this personality type tend to feel directionless or stuck until they connect with a sense of purpose for their lives. For many Mediators, this purpose has something to do with uplifting others and their ability to feel other people’s suffering as if it were their own. While Mediators want to help everyone, they need to focus their energy and efforts – otherwise, they can end up exhausted.",
                "Fortunately, like flowers in the spring, Mediators’ creativity and idealism can bloom even after the darkest of seasons. Although they know the world will never be perfect, Mediators still care about making it better however they can. This quiet belief in doing the right thing may explain why these personalities so often inspire compassion, kindness, and beauty wherever they go."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/J.R.R._Tolkien.png",
                "name": "J.R.R. Tolkien",
                "fictional": 0,
                "movie": "",
                "article": "/articles/jrr-tolkien-creator-of-words-and-worlds-the-lord-of-the-rings-personality-series"
            },
            {
                "avatar": "./assets/celebrities/William_Shakespeare.png",
                "name": "William Shakespeare",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Bju00f6rk.png",
                "name": "Bju00f6rk",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Alicia_Keys.png",
                "name": "Alicia Keys",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tom_Hiddleston.png",
                "name": "Tom Hiddleston",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Julia_Roberts.png",
                "name": "Julia Roberts",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/William_Wordsworth.png",
                "name": "William Wordsworth",
                "fictional": 0,
                "movie": "",
                "article": "/articles/william-wordsworth-dawn-of-a-romantic-mediator-personality"
            },
            {
                "avatar": "./assets/celebrities/Johnny_Depp.png",
                "name": "Johnny Depp",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Frodo_Baggins.png",
                "name": "Frodo Baggins",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Amu00e9lie_Poulain.png",
                "name": "Amu00e9lie Poulain",
                "fictional": 1,
                "movie": "Amu00e9lie",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Arwen.png",
                "name": "Arwen",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Fox_Mulder.png",
                "name": "Fox Mulder",
                "fictional": 1,
                "movie": "X-Files",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Anne.png",
                "name": "Anne",
                "fictional": 1,
                "movie": "Anne of Green Gables",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Sybil_Branson.png",
                "name": "Sybil Branson",
                "fictional": 1,
                "movie": "Downton Abbey",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lance_Sweets.png",
                "name": "Lance Sweets",
                "fictional": 1,
                "movie": "Bones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Konstantin_Levin.png",
                "name": "Konstantin Levin",
                "fictional": 1,
                "movie": "Anna Karenina",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Empathetic ": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Mediators don’t just care about other people in an abstract sense. These personalities can actually feel another person’s emotions, from joy and elation to sorrow and regret. Because of this sensitivity, Mediators tend to be thoughtful and kindhearted, and they hate the idea of hurting anyone, even unintentionally."
                },
                "Generous ": {
                        "image": "./assets/strength_weaknesses/006-original.png",
                        "description": "Mediators rarely enjoy succeeding at other people’s expense. They feel called to share the good things in their lives, give credit where it’s due, and uplift the people around them. These personalities want to contribute to a world where every voice is heard and no one’s needs go unmet."
                    },
               "Open-Minded": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Tolerant and accepting, Mediators try not to judge anyone else’s beliefs, lifestyles, or decisions. This is a personality type that prefers compassion to fault-finding, and many Mediators feel empathy even for those who have done wrong. Because they’re so accepting, Mediators often become confidants for their friends and loved ones – and occasionally for total strangers."
                },
                "Creative ": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Mediators love to see things from unconventional perspectives. Few things give them more pleasure than allowing their minds to wander through all sorts of ideas and possibilities and daydreams. It’s no wonder, then, that many Mediators are drawn to creative pursuits – or that this personality type is well represented among writers and artists."
                },
                "Passionate": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "When an idea or movement captures their imagination, Mediators want to give their whole heart to it. People with this personality type may not always be outspoken, but that doesn’t diminish their strong feelings for a cause that speaks to their beliefs and convictions."
                },
                "Idealistic ": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Mediators strive to follow their conscience, even when doing the right thing isn’t easy or convenient. They rarely lose sight of their desire to live a meaningful, purpose-filled life – one that helps others and leaves the world a better place."
                }
            },
            "weaknesses": {
                "Unrealistic ": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Nothing in this world is perfect – and that can be a difficult truth for Mediators to accept. People with this personality type can be hopeless romantics, with rose-colored visions of what their lives should be like. This can set Mediators up for disappointment when reality inevitably falls short of their dreams."
                },
                "Self-Isolating": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Mediators long to connect with others, but they don’t always know how. Especially in new environments, Mediators may be reluctant to put themselves out there in ways that would help them make new friends or become involved in a new community. As a result, people with this personality type may sometimes feel lonely or isolated."
                },
                "Unfocused ": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Mediators’ imaginative, introspective nature doesn’t always lend itself to productivity. Many Mediators get frustrated by how difficult they find it to buckle down and get things done. The problem isn’t that they are incapable – rather, it’s that they run into problems when they become so caught up in different ideas and ideals that they fail to commit to a course of action."
                },
                "Emotionally Vulnerable": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "The emotional attunement of these personalities is among their greatest strengths. But unless Mediators establish boundaries, they can be at risk of absorbing other people’s negative moods or attitudes."
                },
                "Desperate to Please": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Conflict tends to be stressful for Mediators, who yearn for harmony and acceptance. When someone dislikes or disapproves of them, these personalities may become fixated on trying to clear the air and change that person’s mind. Unfortunately, Mediators’ desire to please others can drain their energy, eclipsing their inner wisdom and their awareness of their own needs."
                },
                "Self-Critical": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Mediators believe in their unique potential, and they desperately want to live up to it. But this can cause them to have unrealistic expectations for themselves. When Mediators fail to live up to these visions, they may accuse themselves of being useless or selfish or woefully inadequate. Taken too far, this self-criticism can discourage Mediators, leading them to give up on even their dearest dreams."
                    }
                }
        },
        "friendships_sections": {
            "Searching for a Kindred Spirit": [
                "Although Mediators are warm and accepting, they don’t always find it easy to make friends. This may be because superficial, casual relationships can leave these personalities feeling a bit empty. Mediators are looking for lasting, authentic friendships with people who share their desire to think and feel deeply, to do the right thing, and to give more to the world than they take from it.",
                "That said, Mediators are capable of befriending all sorts of people. The combination of their Intuitive and Prospecting personality traits draws them to diverse perspectives, which helps them appreciate friends whose experiences and worldviews are totally different from their own. Mediators may actually find it invigorating to connect with someone who, on the surface, has little in common with them.",
                "For Mediators, a true friendship is founded on shared values, not just shared experiences. People with this personality type are unlikely to form strong friendships simply out of convenience. For example, while their affection for their coworkers may be strong, just working in the same office or shop isn’t enough for Mediators to guarantee a substantial friendship. Deeper connections must come into play."
            ],
            "Friends for Life": [
                "When Mediators befriend someone, they may secretly (or not so secretly) hope to stay close with that person for life. These personalities are capable of strong, stable relationships marked by passionate support, subtle poetic wit, and a profound level of emotional insight. Long-standing friendships tend to draw out less obvious aspects of the Mediator personality type, including a fierce protective streak. Many Mediators find that they can stand up for their friends in ways that they’d struggle to manage for themselves.",
                "Although Mediators value their friendships, they also need personal space and alone time in order to recharge. At times, people with this personality type may withdraw from even their closest friends in order to reconnect with themselves and restore their energy, as all Introverts must. These departures are usually temporary, but Mediators may need to make sure that their friends don’t feel snubbed by their absence.",
                "Mediators look for ways to improve their friendships and share their affection with those who matter to them. Often, this takes the form of spending quality time with their friends – coming up with grand visions for the future and sharing their secret dreams and ideas with someone they know they can trust. But even when Mediators are entirely on their own, they always hold their friends in their hearts."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/infp-mediator.svg?v=2",
            "phrase": "Poetic, kind and altruistic people, always eager to help a good cause.",
            "link": "https://www.16personalities.com/infp-personality",
            "type": "Mediator"
        }
    },
    "ENFJ": {
        "intro_pars": [
            "A Protagonist (ENFJ) is a person with the Extraverted, Intuitive, Feeling, and Judging personality traits. These warm, forthright types love helping others, and they tend to have strong ideas and values. They back their perspective with the creative energy to achieve their goals.",
            "Protagonists (ENFJs) feel called to serve a greater purpose in life. Thoughtful and idealistic, these personality types strive to have a positive impact on other people and the world around them. They rarely shy away from an opportunity to do the right thing, even when doing so is far from easy.",
            "Protagonists are born leaders, which explains why these personalities can be found among many notable politicians, coaches, and teachers. Their passion and charisma allow them to inspire others not just in their careers but in every arena of their lives, including their relationships. Few things bring Protagonists a deeper sense of joy and fulfillment than guiding friends and loved ones to grow into their best selves."
        ],
        "intro_sections": {
            "Speaking Up for What’s Right": [
                "Protagonists tend to be vocal about their values, including authenticity and altruism. When something strikes them as unjust or wrong, they speak up. But they rarely come across as brash or pushy, as their sensitivity and insight guide them to speak in ways that resonate with others.",
                "These personality types have an uncanny ability to pick up on people’s underlying motivations and beliefs. At times, they may not even understand how they come to grasp another person’s mind and heart so quickly. These flashes of insight can make Protagonists incredibly persuasive and inspiring communicators.",
                "Protagonists’ secret weapon is their purity of intent. Generally speaking, they are motivated by a sincere wish to do the right thing rather than a desire to manipulate or have power over other people. Even when they disagree with someone, Protagonists search for common ground. The result is that people with this personality type can communicate with an eloquence and sensitivity that are nearly impossible to ignore – particularly when they speak about matters that are close to their hearts."
            ],
            "Getting Involved": [
                "When Protagonists care about someone, they want to help solve that person’s problems – sometimes at any cost. The good news is that many people are grateful for Protagonists’ assistance and advice. After all, there’s a reason that these personalities have a reputation for helping others improve their lives.",
                "But getting involved in other people’s problems isn’t always a recipe for success. Protagonists tend to have a clear vision of what people can or should do in order to better themselves, but not everyone is ready to make those changes. If Protagonists push too hard, their loved ones may feel resentful or unfairly judged. And while this personality type is known for being insightful, even the wisest Protagonists may sometimes misread a situation or unwittingly give bad advice."
            ],
            "Leading the Way": [
                "People with this personality type are devoted altruists, ready to face slings and arrows in order to stand up for the people and ideas that they believe in. This strength of conviction bolsters Protagonists’ innate leadership skills, particularly their ability to guide people to work together in service of the greater good.",
                "But their greatest gift might actually be leading by example. In their day-to-day lives, Protagonists reveal how seemingly ordinary situations can be handled with compassion, dedication, and care. For these personalities, even the smallest daily choices and actions – from how they spend their weekend to what they say to a coworker who is struggling – can become an opportunity to lead the way to a brighter future."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Barack_Obama.png",
                "name": "Barack Obama",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Oprah_Winfrey.png",
                "name": "Oprah Winfrey",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/John_Cusack.png",
                "name": "John Cusack",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Ben_Affleck.png",
                "name": "Ben Affleck",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Malala_Yousafzai.png",
                "name": "Malala Yousafzai",
                "fictional": 0,
                "movie": "",
                "article": "/articles/malala-the-protagonist-the-personality-of-the-youngest-nobel-peace-prize-winner"
            },
            {
                "avatar": "./assets/celebrities/Jennifer_Lawrence.png",
                "name": "Jennifer Lawrence",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Sean_Connery.png",
                "name": "Sean Connery",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Maya_Angelou.png",
                "name": "Maya Angelou",
                "fictional": 0,
                "movie": "",
                "article": "/articles/never-a-caged-bird-maya-angelou-a-protagonist"
            },
            {
                "avatar": "./assets/celebrities/Daenerys_Targaryen.png",
                "name": "Daenerys Targaryen",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Morpheus.png",
                "name": "Morpheus",
                "fictional": 1,
                "movie": "The Matrix",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Elizabeth_Bennet.png",
                "name": "Elizabeth Bennet",
                "fictional": 1,
                "movie": "Pride and Prejudice",
                "article": "/articles/the-big-reveal-elizabeth-bennets-personality-type"
            },
            {
                "avatar": "./assets/celebrities/The_Oracle.png",
                "name": "The Oracle",
                "fictional": 1,
                "movie": "The Matrix",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Skyler_White.png",
                "name": "Skyler White",
                "fictional": 1,
                "movie": "Breaking Bad",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Laurel_Lance.png",
                "name": "Laurel Lance",
                "fictional": 1,
                "movie": "Arrow",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Isobel_Crawley.png",
                "name": "Isobel Crawley",
                "fictional": 1,
                "movie": "Downton Abbey",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Seeley_Booth.png",
                "name": "Seeley Booth",
                "fictional": 1,
                "movie": "Bones",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Receptive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Protagonists have strong opinions, but they’re far from closed-minded. They recognize the importance of allowing others to express themselves fully. Even when Protagonists don’t agree with someone, they recognize that person’s right to voice their truth."
                },
                "Reliable": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Few things bother Protagonists more than the prospect of letting down a person or cause that they believe in. People with this personality type can be counted on to see their promises and responsibilities through – even when it’s difficult to do so."
                },
                    "Passionate": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Protagonists are far from being boring do-gooders. These types brim with interests, and they take great pleasure in pursuing their hobbies – whether that’s hiking, cooking, dancing, growing houseplants, or something else entirely. As a result, they rarely find themselves at a loss for something interesting to do."
                },
                    "Altruistic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "These personalities are known for harboring a deep desire to be a force for positive change. Protagonists genuinely believe that if they bring people together, they can do a world of good."
                },
                    "Charismatic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Determined and inspiring, Protagonists often find their way into leadership roles. Whether they’re captain of their softball team or a leader on the world stage, they rarely lose sight of their main goal: to be of service to others."
                }
            },
            "weaknesses": {
                "Unrealistic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Many Protagonists put pressure on themselves to right every wrong that they encounter. But no matter how hard these personalities strive, it just isn’t realistic for them to solve all of the world’s problems. If they aren’t careful, they can spread themselves too thin – and be left unable to help anyone."
                },
                "Overly Idealistic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Protagonists tend to have clear ideas about what’s right and what’s wrong. They often think that everyone shares these fundamental principles – or, at least, that everyone should share these principles. So it can come as a genuine shock to Protagonists when people violate their core values, such as truth or justice."
                },
                    "Condescending": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "People with this personality type enjoy teaching others, particularly about the causes and beliefs that matter so much to them. But, at times, Protagonists’ attempts to “enlighten” others may come across as patronizing – not the most effective strategy for persuading other people, unfortunately."
                },
                    "Intense": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "When it comes to self-improvement, Protagonists are rarely short on energy or determination. But they may not recognize that not everyone shares these qualities. At times, Protagonists may push others to make changes that they aren’t ready for – or simply aren’t interested in making in the first place."
                },
                    "Overly Empathetic": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Compassion is among this personality type’s greatest strengths. But Protagonists have a tendency to take on other people’s problems as their own – a habit that can leave them emotionally and physically exhausted."
                    }
                }
        },
        "friendships_sections": {
            "A Wealth of Perspectives": [
                "Few personality types can match Protagonists’ sincere desire to get to know people. For Protagonists, discovering someone’s quirks and opinions and hopes and follies is one of life’s purest pleasures. Most Protagonists can’t help but be fascinated by other worldviews, even those with which they wholeheartedly disagree. Encountering a wealth of perspectives is what keeps life interesting for these types.",
                "That said, most Protagonists find it difficult to respect anyone who takes shortcuts, disrespects others, or refuses to challenge the status quo. Instead, they find it easiest to connect with people who share their core ideals, particularly their commitment to doing the right thing and leaving the world better than they found it.",
                "It is with these closest friends that Protagonists truly open up, sharing their vulnerabilities and their most precious dreams for their lives. These personalities maintain warm, caring, and supportive connections with many people, but they tend to show their full selves – including their insecurities – only to an inner circle of friends who have earned their trust."
            ],
            "Through Thick and Thin": [
                "Protagonists can be among the best friends anyone could wish for. Kindhearted and trustworthy, people with this personality type dedicate incredible amounts of energy and attention to their friendships. They want their friends to feel not merely validated but supported, not merely heard but understood.",
                "They can also be trusted to show up in ways both large and small – whether by taking time after a grueling day at work to help a friend spruce up their resume or by putting together a weekend-long destination birthday party for a friend who needs a boost. Nothing makes Protagonists happier than seeing the people they care about doing well, and few things could stop them from trying to help make that happen."
            ],
            "Finding Balance": [
                "While Protagonists enjoy lending a helping hand, they aren’t always happy with the results. The truth is that some people don’t have the energy or the drive to take full advantage of Protagonists’ offers of help – or they simply might not want to. For example, their friend might ignore that resume advice, or they might decide to kick back and relax instead of using that new resume to send out job applications.",
                "When this happens, people with the Protagonist personality type may feel unappreciated, frustrated, or resentful. They may even become judgmental in an effort to push their friend forward – an approach that all too often backfires.",
                "Paradoxically, having a more flexible attitude can guide these types to support the people they care about even more effectively. As many Protagonists discover, the most enduring friendships are based not only on mutual growth but also on acceptance, compassion, and genuine respect."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/enfj-protagonist.svg?v=2",
            "phrase": "Charismatic and inspiring leaders, able to mesmerize their listeners.",
            "link": "https://www.16personalities.com/enfj-personality",
            "type": "Protagonist"
        }
    },
    "ENFP": {
        "intro_pars": [
            "A Campaigner (ENFP) is someone with the Extraverted, Intuitive, Feeling, and Prospecting personality traits. These people tend to embrace big ideas and actions that reflect their sense of hope and goodwill toward others. Their vibrant energy can flow in many directions.",
            "Campaigners (ENFPs) are true free spirits – outgoing, openhearted, and open-minded. With their lively, upbeat approach to life, they stand out in any crowd. But even though they can be the life of the party, Campaigners don’t just care about having a good time. These personality types run deep – as does their longing for meaningful, emotional connections with other people."
        ],
        "intro_sections": {
            "The Magic of Everyday Life": [
                "Friendly and outgoing, Campaigners are devoted to enriching their relationships and their social lives. But beneath their sociable, easygoing exteriors, they have rich, vibrant inner lives as well. Without a healthy dose of imagination, creativity, and curiosity, a Campaigner simply wouldn’t be a Campaigner.",
                "In their unique way, Campaigners can be quite introspective. They can’t help but ponder the deeper meaning and significance of life – even when they should be paying attention to something else. These personalities believe that everything – and everyone – is connected, and they live for the glimmers of insight that they can gain into these connections.",
                "When something sparks their imagination, Campaigners can show an enthusiasm that is nothing short of infectious. These personalities radiate a positive energy that draws in other people, and Campaigners may find themselves being held up by their peers as a leader or guru. But once the initial bloom of inspiration wears off, Campaigners can struggle with self-discipline and consistency, losing steam on projects that once meant so much to them."
            ],
            "Seeking Joy": [
                "Campaigners are proof that seeking out life’s joys and pleasures isn’t the same as being shallow. Seemingly in the blink of an eye, people with this personality type can transform from impassioned idealists to carefree figures on the dance floor.",
                "Even in moments of fun, Campaigners want to connect emotionally with others. Few things matter more to these personality types than having genuine, heartfelt conversations with the people they cherish. Campaigners believe that everyone deserves to express their feelings, and their empathy and warmth create spaces where even the most timid spirits can feel comfortable opening up.",
                "People with this personality type need to be careful, however. Campaigners’ intuition may lead them to read far too much into other people’s actions and behaviors. Instead of simply asking for an explanation, Campaigners may end up puzzling over someone else’s desires or intentions. This kind of social stress is what keeps harmony-focused Campaigners awake at night.",
                "Campaigners will spend a lot of time exploring different relationships, feelings, and ideas before they find a path for their lives that feels right. But when they finally do find their way, their imagination, empathy, and courage can light up not only their own lives but also the world around them."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Robert_Downey,_Jr..png",
                "name": "Robert Downey, Jr.",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Robin_Williams.png",
                "name": "Robin Williams",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Quentin_Tarantino.png",
                "name": "Quentin Tarantino",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/RM_(Kim_Nam-joon).png",
                "name": "RM (Kim Nam-joon)",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Russell_Brand.png",
                "name": "Russell Brand",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Kelly_Clarkson.png",
                "name": "Kelly Clarkson",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Will_Smith.png",
                "name": "Will Smith",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Meg_Ryan.png",
                "name": "Meg Ryan",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Ellen_DeGeneres.png",
                "name": "Ellen DeGeneres",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michael_Scott.png",
                "name": "Michael Scott",
                "fictional": 1,
                "movie": "The Office",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Spider-Man.png",
                "name": "Spider-Man",
                "fictional": 1,
                "movie": "Spider-Man",
                "article": "/articles/peter-parker-aka-spider-man-the-personality-type-of-a-webslinger"
            },
            {
                "avatar": "./assets/celebrities/Phil_Dunphy.png",
                "name": "Phil Dunphy",
                "fictional": 1,
                "movie": "Modern Family",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Piper_Chapman.png",
                "name": "Piper Chapman",
                "fictional": 1,
                "movie": "Orange Is the New Black",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Hoban_Washburne.png",
                "name": "Hoban Washburne",
                "fictional": 1,
                "movie": "Firefly",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Peeta_Mellark.png",
                "name": "Peeta Mellark",
                "fictional": 1,
                "movie": "The Hunger Games",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jennifer_Keller.png",
                "name": "Jennifer Keller",
                "fictional": 1,
                "movie": "Stargate Atlantis",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Carrie_Bradshaw.png",
                "name": "Carrie Bradshaw",
                "fictional": 1,
                "movie": "Sex and the City",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Willy_Wonka.png",
                "name": "Willy Wonka",
                "fictional": 1,
                "movie": "Charlie and the Chocolate Factory",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Curious": {
                    "image": "./assets/strength_weaknesses/012-woman.png",
                    "description": "Campaigners can find beauty and fascination in nearly anything. Imaginative and open-minded, these personalities aren’t afraid to venture beyond their comfort zones in search of new ideas, experiences, and adventures."
                },
                "Perceptive": {
                    "image": "./assets/strength_weaknesses/013-visualization.png",
                    "description": "To people with this personality type, no one is unimportant – which might explain how they can pick up on even the subtlest shifts in another person’s mood or expression. Because they’re so sensitive to other people’s feelings and needs, Campaigners can make full use of their caring, considerate nature."
                },
                "Enthusiastic": {
                    "image": "./assets/strength_weaknesses/014-enthusiast.png",
                    "description": "When something captures their imagination and inspires them, Campaigners want to share it with anyone who will listen. And they’re just as eager to hear other people’s ideas and opinions – even if those thoughts are wildly different from their own."
                },
                "Excellent Communicators": {
                    "image": "./assets/strength_weaknesses/015-communication.png",
                    "description": "Campaigners brim with things to say, but they can be caring listeners as well. This gives them a nearly unmatched ability to have positive and enjoyable conversations with all sorts of people – even people who aren’t particularly sociable or agreeable."
                },
                "Festive": {
                    "image": "./assets/strength_weaknesses/016-balloon.png",
                    "description": "Campaigners may live for deep, meaningful conversations, but they can also be spontaneous and lighthearted. These personalities know how to find fun and joy in the present moment – and few things give them more pleasure than sharing their joy with others."
                },
                "Good-Natured": {
                    "image": "./assets/strength_weaknesses/017-good-vibes.png",
                    "description": "All of these strengths come together to form a person who is warmhearted and approachable, with an altruistic spirit and a friendly disposition. Campaigners strive to get along with pretty much everyone, and their circles of acquaintances and friends often stretch far and wide."
                }
            },
            "weaknesses": {
                "People-Pleasing":{
                    "image":  "./assets/strength_weaknesses/018-asking-help.png",
                    "description": "Most Campaigners are uncomfortable with the prospect of being disliked. To maintain the peace, they may compromise on things that matter to them or allow other people to treat them poorly. And when they fail to win someone over, they might lose sleep trying to figure out what to do about it."
                },
                "Unfocused":{
                    "image":  "./assets/strength_weaknesses/019-unfocused.png",
                    "description": "The thrill of a new project – especially one that involves collaborating with other people – can bring out the best in Campaigners. But this personality type is known for having ever-evolving interests, meaning that Campaigners may find it challenging to maintain discipline and focus over the long term."
                },
                "Disorganized":{
                    "image":  "./assets/strength_weaknesses/020-unorganized.png",
                    "description": "Campaigners’ enthusiasm is legendary, but it doesn’t extend to everything. Specifically, people with this personality type may try to avoid boring, practical matters, such as chores, maintenance, or paperwork. The resulting sense of disorganization can become a major source of stress in their lives."
                },
                "Overly Accommodating":{
                    "image":  "./assets/strength_weaknesses/021-house.png",
                    "description": "Campaigner personalities feel called to uplift others, and they may find themselves saying yes whenever anyone asks them for guidance or help. But unless they set boundaries, even the most energetic Campaigners can become overcommitted, with too little time and energy to tackle the necessities of their own lives."
                },
                "Overly Optimistic":{
                    "image":  "./assets/strength_weaknesses/022-positive-thinking.png",
                    "description": "Optimism can be among this personality type’s key strengths. But Campaigners’ rosy outlook can lead them to make well-intentioned but naive decisions, such as believing people who haven’t earned their trust. This trait can also make it difficult for Campaigners to accept hard but necessary truths – and to share those truths with others."
                },
                "Restless ": {
                    "image":  "./assets/strength_weaknesses/022-stopwatch.png",
                    "description":"With their positive, upbeat attitude, Campaigners rarely seem upset or dissatisfied on the outside. But their inner idealism can leave them with a nagging feeling that some major areas of their life just aren’t good enough – whether that’s their work, their home life, or their relationships."
               }
            }
        },
        "friendships_sections": {
            "The Adventure of Friendship": [
                "Imaginative and upbeat, Campaigners know how to transform even the most ordinary moments into a special occasion. And for these personalities, nearly any opportunity to spend time with friends is a special occasion. Campaigners cherish their friends, and they’d hate to take a single moment together for granted.",
                "As you might expect, Campaigners’ sociable energy can be a magnet for other outgoing personality types. But their warmth and sincerity draws all sorts of people out of their shells, and many Campaigners feel drawn to befriend people who are relatively shy or reserved.",
                "Attracted to depth and nuance, people with this personality type find it gratifying to watch someone gradually open up and reveal their innermost thoughts and feelings. And with their unique combination of sensitivity and enthusiasm, Campaigners can help quieter friends feel understood and accepted – and not a little exhilarated."
            ],
            "In Too Deep": [
                "From the outside, it might seem that friendship comes easily to these personality types – and to some extent, it does. But that doesn’t mean that Campaigners always experience the deep, meaningful relationships that they long for.",
                "Some people simply don’t want to open up emotionally in the way that Campaigners crave. Others may turn out to be closed-minded or judgmental in ways that don’t match their values. To Campaigners, it can sometimes seem as if the rest of the world were satisfied with superficial, casual relationships. In these moments, they can’t help but wonder whether their deep longing for human connection is just too much for other people to handle.",
                "Campaigners’ idealism can also cause issues within their close friendships. This personality type is known for going to great lengths to be caring and helpful, and Campaigners take pride in being unfailingly generous with their energy, time, money, attention, and emotions. But, at times, Campaigners may give so much to their friendships that they can’t meet their own needs. Unfortunately, even between the dearest of friends, this sort of imbalance can create resentment and misunderstanding."
            ],
            "Making Life Spectacular": [
                "Fortunately, Campaigners’ emotional sensitivity enables them to respond not only to their friends’ needs but also to their own. Once Campaigners learn to balance their desire to help others with their need to stay true to themselves, they can bring the full strength of their empathy, curiosity, and joy to their friendships. And the adventures that Campaigners share with their friends are the stuff that a good life is made of."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/enfp-campaigner.svg?v=2",
            "phrase": "Enthusiastic, creative and sociable free spirits, who can always find a reason to smile.",
            "link": "https://www.16personalities.com/enfp-personality",
            "type": "Campaigner"
        }
    },
    "ISTJ": {
        "intro_pars": [
            "A Logistician (ISTJ) is someone with the Introverted, Observant, Thinking, and Judging personality traits. These people tend to be reserved yet willful, with a rational outlook on life. They compose their actions carefully and carry them out with methodical purpose.",
            "Logisticians pride themselves on their integrity. People with this personality type mean what they say, and when they commit to doing something, they make sure to follow through.",
            "This personality type makes up a good portion of the overall population, and while Logisticians may not be particularly flashy or attention-seeking, they do more than their share to keep society on a sturdy, stable foundation. In their families and their communities, Logisticians often earn respect for their reliability, their practicality, and their ability to stay grounded and logical, even in the most stressful situations."
        ],
        "intro_sections": {
            "A Life of Integrity": [
                "The core of Logisticians’ self-respect comes from a sense of personal integrity. People with this personality type believe that there is a right way to proceed in any situation – and that anyone who pretends otherwise is probably trying to bend the rules to suit their own purposes. Logisticians have a deep respect for structure and tradition, and they are often drawn to organizations, workplaces, and educational settings that offer clear hierarchies and expectations.",
                "People with the Logistician personality type rarely hesitate to take responsibility for their actions and choices. Generally speaking, they are quick to own up to their own mistakes, admitting the truth even if it doesn’t make them look good. To Logisticians, honesty is far more important than showmanship, and they’d rather satisfy their own conscience than lie to impress someone else.",
                "Because they strive to meet their obligations no matter what, Logistician personalities are often baffled by people who fail to hold themselves to the same standard. At times, Logisticians might unfairly misjudge people who can’t match their rigorous self-control – suspecting that someone is being lazy or dishonest when that person might actually be coping with other challenges. Even if Logisticians don’t speak these judgments aloud, their disdain can come through regardless, earning them a reputation for being somewhat strict or unempathetic."
            ],
            "Picking Up the Slack": [
                "Logisticians’ dedication is an admirable quality, and it drives many of their accomplishments. But it can also become a weakness that other people take advantage of. With their strong work ethic and sense of duty, Logisticians may routinely find themselves shouldering other people’s responsibilities. Even if they don’t complain about the situation, Logisticians can end up exhausted or discouraged if they’re constantly expected – or taking it upon themselves – to pick up the slack for their colleagues, friends, or loved ones.",
                "Logisticians aren’t known for expressing their emotions readily, but that doesn’t mean that people with this personality type don’t feel frustration or resentment when they’re pulling more than their weight. And unless they make sure that their relationships are balanced and sustainable, Logisticians may end up compromising the very stability that they feel called to protect. The good news is that, by learning to set appropriate boundaries and speak up when they’re overstretched, Logisticians can offer the world the full benefit of their many gifts, including their clarity, their loyalty, and their dependability."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Sting.png",
                "name": "Sting",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Denzel_Washington.png",
                "name": "Denzel Washington",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Angela_Merkel.png",
                "name": "Angela Merkel",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Natalie_Portman.png",
                "name": "Natalie Portman",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Anthony_Hopkins.png",
                "name": "Anthony Hopkins",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/George_Washington.png",
                "name": "George Washington",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Condoleezza_Rice.png",
                "name": "Condoleezza Rice",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/George_H.W._Bush.png",
                "name": "George H.W. Bush",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Eddard_Stark.png",
                "name": "Eddard Stark",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Hermione_Granger.png",
                "name": "Hermione Granger",
                "fictional": 1,
                "movie": "Harry Potter series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Geralt_of_Rivia.png",
                "name": "Geralt of Rivia",
                "fictional": 1,
                "movie": "The Witcher series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Mr._Darcy.png",
                "name": "Mr. Darcy",
                "fictional": 1,
                "movie": "Pride and Prejudice",
                "article": "/articles/mr-darcys-personality-type-revealed"
            },
            {
                "avatar": "./assets/celebrities/Dana_Scully.png",
                "name": "Dana Scully",
                "fictional": 1,
                "movie": "X-Files",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jason_Bourne.png",
                "name": "Jason Bourne",
                "fictional": 1,
                "movie": "Bourne series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Thorin_Oakenshield.png",
                "name": "Thorin Oakenshield",
                "fictional": 1,
                "movie": "The Hobbit",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Stannis_Baratheon.png",
                "name": "Stannis Baratheon",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Inspector_Lestrade.png",
                "name": "Inspector Lestrade",
                "fictional": 1,
                "movie": "Sherlock Holmes series",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Honest and Direct": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Integrity is the heart of the Logistician personality type. Emotional manipulation, mind games and reassuring lies all run counter to Logisticians’ preference for managing the reality of the situations they encounter with plain and simple honesty."
                },
                "Strong-willed and Dutiful": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Logisticians embody that integrity in their actions too, working hard and staying focused on their goals. Patient and determined, people with the Logistician personality type meet their obligations, period."
                },
                "Very Responsible": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Logisticians’ word is a promise, and a promise means everything. Logisticians would rather run themselves into the ground with extra days and lost sleep than fail to deliver the results they said they would. Loyalty is a strong sentiment for Logistician personalities, and they fulfill their duties to the people and organizations they’ve committed themselves to."
                },
                "Calm and Practical": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "None of their promises would mean much if Logisticians lost their tempers and broke down at every sign of hardship – they keep their feet on the ground and make clear, rational decisions. Peoples’ preferences are a factor to consider in this process, and Logisticians work to make the best use of individual qualities, but these decisions are made with effectiveness in mind more so than empathy. The same applies to criticisms, for others and themselves."
                },
                "Create and Enforce Order": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "The primary goal of any Logistician is to be effective in what they’ve chosen to do, and they believe that this is accomplished best when everyone involved knows exactly what is going on and why. Unclear guidelines and people who break established rules undermine this effort, and are rarely tolerated by Logisticians. Structure and rules foster dependability; chaos creates unforeseen setbacks and missed deadlines."
                },
                "Jacks-of-all-trades": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Much like Analyst personality types, Logisticians are proud repositories of knowledge, though the emphasis is more on facts and statistics than concepts and underlying principles. This allows Logisticians to apply themselves to a variety of situations, picking up and applying new data and grasping the details of challenging situations as a matter of course."
                    }
                },
            "weaknesses": {
                "Stubborn": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "The facts are the facts, and Logisticians tend to resist any new idea that isn’t supported by them. This factual decision-making process also makes it difficult for people with the Logistician personality type to accept that they were wrong about something – but anyone can miss a detail, even them."
                },
                "Insensitive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "While not intentionally harsh, Logisticians often hurt more sensitive types’ feelings by the simple mantra that honesty is the best policy. Logistician personalities may take emotions into consideration, but really only so far as to determine the most effective way to say what needs to be said."
                },
                "Always by the Book": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Logisticians believe that things work best with clearly defined rules, but this makes them reluctant to bend those rules or try new things, even when the downside is minimal. Truly unstructured environments leave Logisticians all but paralyzed."
                },
                "Judgmental": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Opinions are opinions and facts are facts, and Logisticians are unlikely to respect people who disagree with those facts, or especially those who remain willfully ignorant of them."
                },
                "Often Unreasonably Blame Themselves": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "All this can combine to make Logisticians believe they are the only ones who can see projects through reliably. As they load themselves with extra work and responsibilities, turning away good intentions and helpful ideas, Logisticians sooner or later hit a tipping point where they simply can’t deliver. Since they’ve heaped the responsibility on themselves, Logisticians then believe the responsibility for failure is theirs alone to bear."
                    }
                }
        },
        "friendships_sections": {
            "The Gift of Loyalty": [
                "Logisticians are a very methodical personality type, and this loyalty isn’t given away lightly. Often slow to make friends, Logisticians usually end up with a smaller circle, but they consider that circle to represent a promise to be there for the people they care about, and Logisticians’ promises are not easily broken.",
                "Expressing emotional affection isn’t one of Logisticians’ stronger skills, but they nevertheless find ways to show it. As Socrates said, “To be is to do”, and Logisticians’ follow-through, their willingness to take action as a show of support, stands in for their words.",
                "But all of this sounds terribly serious, and indeed it only shows the one side of Logisticians and their approach to their friendships. The other side knows how to stop being quite so staid, and especially in the company of joyful and talkative Extraverts (E), Logisticians enjoy relaxing and having fun with a good discussion about work, life, and current events.",
                "People with the Logistician personality type don’t like conflict, and this applies to how they select their friends as well. Seeking out friends with similar principles and opinions, Logisticians most often befriend other Sentinels personalities, who are likely to share their perspective and world vision. While they are unlikely to become friends with substantially different types – it simply takes too much energy to bridge the communication gap – Logistician personalities still recognize and appreciate others’ strengths and qualities."
            ],
            "Better Together": [
                "In fact, as if to prove the point, Logisticians almost always have at least one Intuitive (N) friend in their inner circle, despite the disconnect the two perspectives bring. These are very much relationships built not on mutual understanding, but out of respect for their mutual differences. Logisticians marvel at Intuitives’ breadth of thought, being very much in tune with their own intelligence, while Intuitives admire Logisticians’ realism and dependability, something they are often hard-pressed to find in themselves. Knowledge, as always, is the great equalizer."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/istj-logistician.svg?v=2",
            "phrase": "Practical and fact-minded individuals, whose reliability cannot be doubted.",
            "link": "https://www.16personalities.com/istj-personality",
            "type": "Logistician"
        }
    },
    "ISFJ": {
        "intro_pars": [
            "A Defender (ISFJ) is someone with the Introverted, Observant, Feeling, and Judging personality traits. These people tend to be warm and unassuming in their own steady way. They’re efficient and responsible, giving careful attention to practical details in their daily lives.",
            "In their unassuming, understated way, Defenders help make the world go round. Hardworking and devoted, people with this personality type feel a deep sense of responsibility to those around them. Defenders can be counted on to meet deadlines, remember birthdays and special occasions, uphold traditions, and shower their loved ones with gestures of care and support. But they rarely demand recognition for all that they do, preferring instead to operate behind the scenes.",
            "This is a capable, can-do personality type, with a wealth of versatile gifts. Though sensitive and caring, Defenders also have excellent analytical abilities and an eye for detail. And despite their reserve, they tend to have well-developed people skills and robust social relationships. Defenders are truly more than the sum of their parts, and their varied strengths shine in even the most ordinary aspects of their daily lives."
        ],
        "intro_sections": {
            "The Gift of Loyalty": [
                "Among Defenders’ most distinctive traits is loyalty. Rare is the Defender who allows a friendship or relationship to fade away from lack of effort. Instead, they invest a great deal of energy into maintaining strong connections with their loved ones – and not just by sending “How are you doing?” texts. People with this personality type are known for dropping everything and lending a hand whenever a friend or family member is going through a hard time.",
                "Defenders’ sense of loyalty doesn’t stop with their nearest and dearest – it often extends to their communities, their employers, and even family traditions. But the intensity of their commitment and desire to serve can have its downsides. Other people may take advantage of Defenders’ helpful, hardworking nature, leaving them feeling burned out and overworked. And Defenders may feel guilty or stressed when they contemplate changes – even necessary changes – to themselves, their relationships, or the way they’ve done things in the past."
            ],
            "The Highest of Standards": [
                "For Defenders, “good enough” is rarely good enough. People with this personality type can be meticulous to the point of perfectionism. They take their responsibilities personally, consistently going above and beyond and doing everything that they can to exceed others’ expectations.",
                "But what happens when Defenders’ efforts go unnoticed or unappreciated? While Defenders tend to underplay their accomplishments, that doesn’t mean that they don’t enjoy recognition – or that they’re fine with being taken for granted. Unless they learn to stand up for themselves, Defenders may find themselves quietly losing their enthusiasm and motivation, eventually becoming resentful toward the people who just don’t seem to appreciate them."
            ],
            "Showing Up for Others – and Themselves": [
                "Although they’re Introverted, Defenders have a deeply social nature. Thanks to their ability to remember the details of other people’s lives, Defenders have a special talent for making their friends and acquaintances feel seen, known, and cherished. Few personality types can match Defenders’ ability to choose just the right gift for any occasion, whether large or small.",
                "Dedicated and thoughtful, Defenders find great joy in helping those around them build stable, secure, and happy lives. It may not be easy for people with this personality type to show up for themselves in the way that they show up for other people, but when they do, they often find themselves with even more energy and motivation to do good in the world."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Beyoncu00e9.png",
                "name": "Beyoncu00e9",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Queen_Elizabeth_II.png",
                "name": "Queen Elizabeth II",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Aretha_Franklin.png",
                "name": "Aretha Franklin",
                "fictional": 0,
                "movie": "",
                "article": "/articles/aretha-franklin-an-icon-and-a-defender"
            },
            {
                "avatar": "./assets/celebrities/Vin_Diesel.png",
                "name": "Vin Diesel",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Halle_Berry.png",
                "name": "Halle Berry",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Kate_Middleton.png",
                "name": "Kate Middleton",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Anne_Hathaway.png",
                "name": "Anne Hathaway",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lance_Reddick.png",
                "name": "Lance Reddick",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Selena_Gomez.png",
                "name": "Selena Gomez",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Catelyn_Stark.png",
                "name": "Catelyn Stark",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Samwise_Gamgee.png",
                "name": "Samwise Gamgee",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Dr_Watson.png",
                "name": "Dr Watson",
                "fictional": 1,
                "movie": "Sherlock Holmes series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Captain_America.png",
                "name": "Captain America",
                "fictional": 1,
                "movie": "Captain America",
                "article": "/articles/captain-america-the-defender-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Triss_Merigold.png",
                "name": "Triss Merigold",
                "fictional": 1,
                "movie": "The Witcher series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Will_Turner.png",
                "name": "Will Turner",
                "fictional": 1,
                "movie": "Pirates of the Caribbean",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Pam_Beesly.png",
                "name": "Pam Beesly",
                "fictional": 1,
                "movie": "The Office",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Vito_Corleone.png",
                "name": "Vito Corleone",
                "fictional": 1,
                "movie": "The Godfather",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Bree_Van_de_Kamp.png",
                "name": "Bree Van de Kamp",
                "fictional": 1,
                "movie": "Desperate Housewives",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Supportive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Defenders truly enjoy helping others, and they happily share their knowledge, attention, and expertise with anyone who needs it. People with this personality type strive for win-win situations, choosing teamwork over competition whenever possible."
                },
                "Reliable": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Rather than working in sporadic, excited bursts that leave things half finished, Defenders are meticulous and careful. They take a steady approach, ensuring that things are done to the highest standard – and often going well beyond what is required."
                },
                "Observant": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Defender personalities have a talent for noticing things, particularly about other people. They pay attention to the smallest details of what someone says and does, giving them unexpected insights into other people’s lives and emotions."
                },
                "Enthusiastic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "When the goal is right, Defenders apply all of their gifts to something that they believe will make a real, positive difference in people’s lives – whether that’s fighting poverty with a global initiative or simply making a customer’s day."
                },
                "Hardworking": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Defenders don’t just get their work done – they take pride in it. People with this personality type often form an emotional attachment to the projects and organizations that they’ve dedicated themselves to, and they won’t rest until they’ve done their share – or more than their share – to be of help."
                },
                    "Good Practical Skills": {
                        "image": "./assets/strength_weaknesses/006-original.png",
                        "description": "This personality type offers the rare combination of an altruistic nature and hard-won practicality. Defenders don’t just hope to help others. They take action – meaning that they’re more than happy to roll up their sleeves and do what’s necessary to care for their friends, family, and anyone else who needs it."
                    }
                },
            "weaknesses": {
                "Overly Humble": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Defenders are so concerned with other people’s feelings that they may refuse to make their thoughts known or to take any duly earned credit for their contributions. And they often downplay their efforts entirely when they think that they could have done some minor aspect of a task better."
                },
                "Taking Things Personally": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Although they might try to hide it, people with this personality type are deeply sensitive to others’ opinions, and they can be thrown off-balance if someone doesn’t appreciate, approve of, or agree with them. When they encounter criticism or disagreement – even if it’s well intentioned – Defenders may feel as if they’re experiencing a personal attack."
                },
                    "Repressing Their Feelings": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Private and reserved, Defenders tend to internalize their feelings, particularly negative ones. This can create misunderstandings in their relationships. Eventually, all of their repressed feelings and resentments may boil over in a sudden, uncharacteristic outburst of frustration."
                },
                    "Overcommitted": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Defenders’ dutifulness can create situations where they are overwhelmed but unwilling to relax their standards or ask for help. As a result, Defender personalities may suffer silently, trying to do everything themselves, even when it’s simply impossible."
                },
                    "Reluctant to Change": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Defenders are among the personality types that struggle the most with change. Breaking with tradition isn’t easy for Defenders, who place great value on history and precedent. Even when change is necessary, they may wait until the situation reaches a breaking point before altering course."
                },
                    "Too Altruistic": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Defenders’ giving, generous nature can leave them vulnerable to being taken advantage of by others. It can be hard for people with this personality type to rock the boat and stand up to someone who isn’t pulling their own weight."
                    }
                }
        },
        "friendships_sections": {
            "Getting Along": [
                "Deep down, many Defenders long to be liked and accepted. This is a natural desire, and it helps explain why people with this personality type are known for being such thoughtful, reliable friends. Defenders care about what other people think of them, so they strive to bring their best selves to all of their relationships, including their friendships.",
                "This trait tends to make Defenders exceptional friends. If taken too far, however, it can lead them to fall into the trap of people-pleasing. Some personality types have no trouble expressing an unpopular opinion or posing an awkward question – but not Defenders. Defenders are reluctant to rock the boat, whether that means asking a friend to pay back a loan or disagreeing with where everyone else wants to go for dinner.",
                "In most cases, this behavior stems from a fear of being rejected. While most Defenders are perfectly comfortable having a small, tight-knit circle of friends, they hate the idea of risking the disapproval of even one of those friends. The problem is that, over time, people-pleasing can cause Defenders to lose touch with their sense of self and their ability to make decisions on their own terms."
            ],
            "Seeking Balance": [
                "Few personality types can match Defenders’ fervent desire to be there for their friends through thick and thin. Ever ready to offer advice, help, and reassurance, Defenders take pride in the fact that people turn to them in times of need – in fact, showing up for their friends in this way offers people with this personality type a sense of purpose in life.",
                "In return, all Defenders wish for is loyalty and respect – and, in an ideal world, a bit of recognition for all that they do. But even though many Defenders crave validation and support from their friends, they tend to be too proud to ask for it, just as they may not be comfortable asking for the help that they need. Fortunately, with time, many Defenders learn that anyone who takes advantage of their generous, altruistic nature isn’t a true friend."
            ],
            "An Inspired Bond": [
                "Defenders can become attached to their visions of how things “should” be. In the world of friendship, they may believe – consciously or not – that they should be completely selfless. But when they ease up on this expectation, balancing their friends’ needs with their own, people with this personality type can bring the full magnitude of their gifts to their friendships. And this helps them enjoy the sort of meaningful, enduring bonds that make life all the more worthwhile."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/isfj-defender.svg?v=2",
            "phrase": "Very dedicated and warm protectors, always ready to defend their loved ones.",
            "link": "https://www.16personalities.com/isfj-personality",
            "type": "Defender"
        }
    },
    "ESTJ": {
        "intro_pars": [
            "An Executive (ESTJ) is someone with the Extraverted, Observant, Thinking, and Judging personality traits. They possess great fortitude, emphatically following their own sensible judgment. They often serve as a stabilizing force among others, able to offer solid direction amid adversity.",
            "Executives are representatives of tradition and order, utilizing their understanding of what is right, wrong and socially acceptable to bring families and communities together. Embracing the values of honesty, dedication and dignity, people with the Executive personality type are valued for their clear advice and guidance, and they happily lead the way on difficult paths. Taking pride in bringing people together, Executives often take on roles as community organizers, working hard to bring everyone together in celebration of cherished local events, or in defense of the traditional values that hold families and communities together."
        ],
        "intro_sections": {
            "Leading by Example": [
                "Demand for such leadership is high in democratic societies, and forming no less than 11% of the population, it’s no wonder that many of America’s presidents have been Executives. Strong believers in the rule of law and authority that must be earned, Executive personalities lead by example, demonstrating dedication and purposeful honesty, and an utter rejection of laziness and cheating, especially in work. If anyone declares hard, manual work to be an excellent way to build character, it is Executives.",
                "Executives are aware of their surroundings and live in a world of clear, verifiable facts – the surety of their knowledge means that even against heavy resistance, they stick to their principles and push an unclouded vision of what is and is not acceptable. Their opinions aren’t just empty talk either, as Executives are more than willing to dive into the most challenging projects, improving action plans and sorting details along the way, making even the most complicated tasks seem easy and approachable.",
                "However, Executives don’t work alone, and they expect their reliability and work ethic to be reciprocated – people with this personality type meet their promises, and if partners or subordinates jeopardize them through incompetence or laziness, or worse still, dishonesty, they do not hesitate to show their wrath. This can earn them a reputation for inflexibility, a trait shared by all Sentinel personalities, but it’s not because Executives are arbitrarily stubborn, but because they truly believe that these values are what make society work."
            ],
            "A Greater Responsibility": [
                "The main challenge for Executives is to recognize that not everyone follows the same path or contributes in the same way. A true leader recognizes the strength of the individual, as well as that of the group, and helps bring those individuals’ ideas to the table. That way, Executives really do have all the facts, and are able to lead the charge in directions that work for everyone."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Sonia_Sotomayor.png",
                "name": "Sonia Sotomayor",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/John_D._Rockefeller.png",
                "name": "John D. Rockefeller",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Judge_Judy.png",
                "name": "Judge Judy",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Ella_Baker.png",
                "name": "Ella Baker",
                "fictional": 0,
                "movie": "",
                "article": "/articles/ella-baker-unsung-hero-activist-and-executive"
            },
            {
                "avatar": "./assets/celebrities/Frank_Sinatra.png",
                "name": "Frank Sinatra",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/James_Monroe.png",
                "name": "James Monroe",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Laura_Linney.png",
                "name": "Laura Linney",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lyndon_B._Johnson.png",
                "name": "Lyndon B. Johnson",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Boromir.png",
                "name": "Boromir",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Dwight_Schrute.png",
                "name": "Dwight Schrute",
                "fictional": 1,
                "movie": "The Office",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Claire_Dunphy.png",
                "name": "Claire Dunphy",
                "fictional": 1,
                "movie": "Modern Family",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Ana_Lucia_Cortez.png",
                "name": "Ana Lucia Cortez",
                "fictional": 1,
                "movie": "Lost",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Violet_Crawley.png",
                "name": "Violet Crawley",
                "fictional": 1,
                "movie": "Downton Abbey",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Robb_Stark.png",
                "name": "Robb Stark",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lisa_Cuddy.png",
                "name": "Lisa Cuddy",
                "fictional": 1,
                "movie": "House M.D.",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Porthos.png",
                "name": "Porthos",
                "fictional": 1,
                "movie": "The Three Musketeers",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                    "Dedicated": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "Seeing things to completion borders on an ethical obligation for Executives. Tasks aren’t simply abandoned because they’ve become difficult or boring – people with the Executive personality type take them up when they are the right thing to do, and they will be finished so long as they remain the right thing to do."
                },
                "Strong-willed": {
                    "image":  "./assets/strength_weaknesses/002-willpower.png",
                    "description":"A strong will makes this dedication possible, and Executives don’t give up their beliefs because of simple opposition. Executives defend their ideas and principles relentlessly, and must be proven clearly and conclusively wrong for their stance to budge."
                },
                "Direct and Honest": {
                        "image":  "./assets/strength_weaknesses/003-serious.png",
                        "description": "Executives trust facts far more than abstract ideas or opinions. Straightforward statements and information are king, and Executive personalities return the honesty (whether it’s wanted or not)."
                },
                "Loyal, Patient and Reliable":{
                            "image":  "./assets/strength_weaknesses/004-loyalty.png",
                            "description":"Executives work to exemplify truthfulness and reliability, considering stability and security very important. When Executives say they’ll do something, they keep their word, making them very responsible members of their families, companies and communities."
                },
             "Enjoy Creating Order":{
                "image":  "./assets/strength_weaknesses/005-order-now.png",
                "description":"Chaos makes things unpredictable, and unpredictable things can’t be trusted when they are needed most – with this in mind, Executives strive to create order and security in their environments by establishing rules, structures and clear roles."
                },
                "Excellent Organizers": {
                    "image":  "./assets/strength_weaknesses/006-task.png",
                    "description": "This commitment to truth and clear standards makes Executives capable and confident leaders. People with this personality type have no problem distributing tasks and responsibilities to others fairly and objectively, making them excellent administrators."
                }
          },
            "weaknesses": {
                "Inflexible and Stubborn": {
                    "image":  "./assets/strength_weaknesses/007-people.png",
                    "description": "The problem with being so fixated on what works is that Executives too often dismiss what might work better. Everything is opinion until proven, and Executive personalities are reluctant to trust an opinion long enough for it to have that chance."
                    },
                "Uncomfortable with Unconventional Situations": {
                    "image":  "./assets/strength_weaknesses/008-uncomfortable.png",
                    "description": "Executives are strong adherents to tradition and when suddenly forced to try unvetted solutions, they become uncomfortable and stressed. New ideas suggest that their methods weren’t good enough, and abandoning what has always worked before in favor of something that may yet fail risks their image of reliability."
                 },
                  "Judgmental": {
                    "image":  "./assets/strength_weaknesses/009-judge.png",
                    "description": "Executives have strong convictions about what is right, wrong, and socially acceptable. Executives’ compulsion to create order often extends to all things and everyone, ignoring the possibility that there are two right ways to get things done. Executives do not hesitate to let these “deviants” know what they think, considering it their duty to set things right."
                },
                "Too Focused on Social Status":  {
                    "image":  "./assets/strength_weaknesses/010-social-status.png",
                    "description": "Executives take pride in the respect of their friends, colleagues and community and while difficult to admit, are very concerned with public opinion. Executives (especially Turbulent ones) can get so caught up in meeting others’ expectations that they fail to address their own needs."
                 },
                  "Difficult to Relax":  {
                    "image":  "./assets/strength_weaknesses/010-social-status.png",
                    "description":"This need for respect fosters a need to maintain their dignity, which can make it difficult to cut loose and relax for risk of looking the fool, even in good fun."
                },
                    "Difficulty Expressing Emotion":  {
                        "image":  "./assets/strength_weaknesses/011-fidget.png",
                        "description":"This is all evidence of Executives’ greatest weakness: expressing emotions and feeling empathy. People with the Executive personality type get so caught up in the facts and most effective methods that they forget to think of what makes others happy, or of their sensitivity. A detour can be breathtakingly beautiful, a joy for the family, but Executives may only see the consequence of arriving at their destination an hour late, hurting their loved ones by rejecting the notion too harshly."
                }
            }
        },
        "friendships_sections": {
            "Setting the Course": [
                "Among their established friends, Executives show themselves to be outgoing and enthusiastic, always more than happy to bring others along for some healthy sport and outdoor activity. Executives sometimes get a little overbearing in their push for participation, but it’s just because they want everyone to have a good time. Executives’ friends are never short on invites to social activities and events, from tickets to a local ball game, to a weekend camping trip, to Sunday BBQ.",
                "Executives seek strong friendships founded on trust and loyalty (though loyalty to family does come first). Active and with quick minds, people with the Executive personality type can’t ever be accused of not doing enough to fend off a little boredom. While Executives may not always be the life of the party, they know how to play their part in making sure their friends have a good time.",
                "The way Executives establish and maintain their friendships does limit the pool though, as they tend to seek out people who are similar to themselves, who share their respect for traditions and institutions. Executive personalities are naturally stubborn, and it can be hard for them to find enough common ground with people who constantly disagree with their principles and beliefs to really form those ties of friendship."
            ],
            "A Broader Reach": [
                "Executives’ challenge in friendship isn’t about finding fun things to do or people to do them with, but in finding diversity in their friends and activities. For all their community participation, Executives struggle immensely in even fully listening to differing opinions, let alone befriending people who consistently express alternate viewpoints. Whether about local political issues or the validity of a more emotional, idealistic disposition than they think is reasonable, Executives should make an effort to truly understand these alternate viewpoints.",
                "Exposing themselves to new ideas among acquaintances who think differently can do no harm – either people with the Executive personality type discover better ways and a stronger foundation, or they gain all the more confidence in their beliefs for having successfully defended them. Just as Executives may think those loners who spend their lives in their basements playing video games need to get out more, Executives themselves need to make sure they get out of their own bubbles of unchallenged opinions and beliefs."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/estj-executive.svg?v=2",
            "phrase": "Excellent administrators, unsurpassed at managing things – or people.",
            "link": "https://www.16personalities.com/estj-personality",
            "type": "Executive"
        }
    },
    "ESFJ": {
        "intro_pars": [
            "A Consul (ESFJ) is a person with the Extraverted, Observant, Feeling, and Judging personality traits. They are attentive and people-focused, and they enjoy taking part in their social community. Their achievements are guided by decisive values, and they willingly offer guidance to others.",
            "For Consuls, life is sweetest when it’s shared with others. People with this personality type form the bedrock of many communities, opening their homes – and their hearts – to friends, loved ones, and neighbors.",
            "This doesn’t mean that Consuls like everyone, or that they’re saints. But Consuls do believe in the power of hospitality and good manners, and they tend to feel a sense of duty to those around them. Generous and reliable, people with this personality type often take it upon themselves – in ways both large and small – to hold their families and their communities together."
        ],
        "intro_sections": {
            "The Beauty of a Responsible Life": [
                "Consuls are altruists. They take seriously their responsibilities to give back, serve others, and do the right thing.",
                "And Consuls believe that there is a clear right thing to do in nearly every situation. While some personality types adopt a more lenient, live-and-let-live attitude, Consuls may find it difficult not to judge when someone takes a path that strikes them as misguided. As a result, Consuls often struggle to accept it when someone – particularly someone they care about – disagrees with them.",
                "With their definite views on right and wrong, Consuls tend to be on the opinionated side. But these opinions aren’t arbitrary – they’re often based on a deep respect for tradition. Consuls know that everything they do affects someone else, and they trust that established laws, protocols, and social norms will help them navigate their everyday lives in a way that is considerate and responsible toward others."
            ],
            "Building Relationships That Last": [
                "Supportive and outgoing, Consuls can always be spotted at a party – they’re the ones fluttering around making sure that everyone else is having a good time! But make no mistake: Consuls don’t just breeze through other people’s lives. Loyal to the core, they build lasting relationships, and they can be counted on to show up whenever a helping hand – or a listening ear – is needed.",
                "With their love of order and structure, Consuls prefer planned events to open-ended activities or spontaneous get-togethers – and they’re happy to host in order to ensure that everything goes smoothly. People with this personality type put a great deal of energy into making other people feel special and celebrated, and they may take it personally when someone doesn’t seem to appreciate their efforts.",
                "For many people with the Consul personality type, one of life’s greatest challenges is accepting that they can’t control anyone else’s thoughts or behavior – not even those who are nearest and dearest to them. Fortunately, Consuls can find peace and fulfillment by focusing on what they do best: setting an example of care, consideration, and responsibility – and bringing people together in the process."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Taylor_Swift.png",
                "name": "Taylor Swift",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jennifer_Garner.png",
                "name": "Jennifer Garner",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Bill_Clinton.png",
                "name": "Bill Clinton",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Steve_Harvey.png",
                "name": "Steve Harvey",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Danny_Glover.png",
                "name": "Danny Glover",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jennifer_Lopez.png",
                "name": "Jennifer Lopez",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Sally_Field.png",
                "name": "Sally Field",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tyra_Banks.png",
                "name": "Tyra Banks",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Sansa_Stark.png",
                "name": "Sansa Stark",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Dean_Winchester.png",
                "name": "Dean Winchester",
                "fictional": 1,
                "movie": "Supernatural",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jack_Shephard.png",
                "name": "Jack Shephard",
                "fictional": 1,
                "movie": "Lost",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Cersei_Lannister.png",
                "name": "Cersei Lannister",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Carmela_Soprano.png",
                "name": "Carmela Soprano",
                "fictional": 1,
                "movie": "The Sopranos",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Monica.png",
                "name": "Monica",
                "fictional": 1,
                "movie": "Friends",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Mrs._Hudson.png",
                "name": "Mrs. Hudson",
                "fictional": 1,
                "movie": "Sherlock Holmes series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Larry_Bloom.png",
                "name": "Larry Bloom",
                "fictional": 1,
                "movie": "Orange Is the New Black",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Strong Practical Skills": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Consuls are excellent managers of day-to-day tasks and routine maintenance, enjoying making sure that those who are close to them are well cared for."
                },
                "Strong Sense of Duty": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "People with the Consul personality type have a strong sense of responsibility and strive to meet their obligations, though this may sometimes be more from a sense of social expectations than intrinsic drive."
                },
                "Very Loyal": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Valuing stability and security very highly, Consuls are eager to preserve the status quo, which makes them extremely loyal and trustworthy partners and employees. Consuls are true pillars of any groups they belong to – whether it is their family or a community club, people with this personality type can always be relied upon."
                },
                "Sensitive and Warm": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Helping to ensure that stability, Consul personalities seek harmony and care deeply about other people’s feelings, being careful not to offend or hurt anybody. Consuls are strong team players, and win-win situations are the stuff smiles are made of."
                },
                "Good at Connecting with Others": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "These qualities come together to make Consuls social, comfortable and well-liked. Consul personalities have a strong need to “belong”, and have no problem with small talk or following social cues in order to help them take an active role in their communities."
                    }
                },
            "weaknesses": {
                "Worried about Their Social Status": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "These Strengths are related to a chief Weakness: Consuls’ preoccupation with social status and influence, which affects many decisions they make, potentially limiting their creativity and open-mindedness."
                },
                "Inflexible": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Consuls place a lot of importance on what is socially acceptable, and can be very cautious, even critical of anything unconventional or outside the mainstream. People with this personality type may also sometimes push their own beliefs too hard in an effort to establish them as mainstream."
                },
                "Reluctant to Innovate or Improvise": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Just as they can be critical of others’ “unusual” behavior, Consuls may also be unwilling to step out of their own comfort zones, usually for fear of being (or just appearing) different."
                },
                "Vulnerable to Criticism": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "It can be especially challenging to change these tendencies because Consuls are so conflict-averse. Consul personalities can become very defensive and hurt if someone, especially a person close to them, criticizes their habits, beliefs or traditions."
                },
                "Often Too Needy": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Consuls need to hear and see a great deal of appreciation. If their efforts go unnoticed, people with the Consul personality type may start fishing for compliments, in an attempt to get reassurance of how much they are valued."
                },
                "Too Selfless": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "The other side of this is that Consuls sometimes try to establish their value with doting attention, something that can quickly overwhelm those who don’t need it, making it ultimately unwelcome. Furthermore, Consuls often neglect their own needs in the process."
                    }
                }
        },
        "friendships_sections": {
            "We’re All in This Together": [
                "On the other hand, Consuls are great at using their sensitivity to stay in tune with what motivates and drives their friends. While in their weaker moments, Consul personalities can sometimes use these observations to manipulate others, they are far more interested in maintaining strong relationships, and this is a great tool for doing so. Altruists that they are, Consuls almost always use their powers for good, encouraging and inspiring others.",
                "By and large, the Consul personality type is a pleasant and sincere one. Their energy and social intelligence win them many acquaintances and friends, and their support and dedication keep those friendships close and strong. With so much zest for life and company, dull moments are sure to be few and far between."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/esfj-consul.svg?v=2",
            "phrase": "Extraordinarily caring, social and popular people, always eager to help.",
            "link": "https://www.16personalities.com/esfj-personality",
            "type": "Consul"
        }
    },
    "ISTP": {
        "intro_pars": [
            "A Virtuoso (ISTP) is someone with the Introverted, Observant, Thinking, and Prospecting personality traits. They tend to have an individualistic mindset, pursuing goals without needing much external connection. They engage in life with inquisitiveness and personal skill, varying their approach as needed.",
            "Virtuosos love to explore with their hands and their eyes, touching and examining the world around them with cool rationalism and spirited curiosity. People with this personality type are natural Makers, moving from project to project, building the useful and the superfluous for the fun of it, and learning from their environment as they go. Often mechanics and engineers, Virtuosos find no greater joy than in getting their hands dirty pulling things apart and putting them back together, just a little bit better than they were before.",
            "Virtuosos explore ideas through creating, troubleshooting, trial and error and first-hand experience. They enjoy having other people take an interest in their projects and sometimes don’t even mind them getting into their space. Of course, that’s on the condition that those people don’t interfere with Virtuosos’ principles and freedom, and they’ll need to be open to Virtuosos returning the interest in kind.",
            "Virtuosos enjoy lending a hand and sharing their experience, especially with the people they care about, and it’s a shame they’re so uncommon, making up only about five percent of the population. Virtuoso women are especially rare, and the typical gender roles that society tends to expect can be a poor fit – they’ll often be seen as tomboys from a young age."
        ],
        "intro_sections": {
            "Dare to Differ": [
                "While their mechanical tendencies can make them appear simple at a glance, Virtuosos are actually quite enigmatic. Friendly but very private, calm but suddenly spontaneous, extremely curious but unable to stay focused on formal studies, Virtuoso personalities can be a challenge to predict, even by their friends and loved ones. Virtuosos can seem very loyal and steady for a while, but they tend to build up a store of impulsive energy that explodes without warning, taking their interests in bold new directions.",
                "Virtuosos’ decisions stem from a sense of practical realism, and at their heart is a strong sense of direct fairness, a “do unto others” attitude, which really helps to explain many of Virtuosos’ puzzling traits. Instead of being overly cautious though, avoiding stepping on toes in order to avoid having their toes stepped on, Virtuosos are likely to go too far, accepting likewise retaliation, good or bad, as fair play.",
                "The biggest issue Virtuosos are likely to face is that they often act too soon, taking for granted their permissive nature and assuming that others are the same. They’ll be the first to tell an insensitive joke, get overly involved in someone else’s project, roughhouse and play around, or suddenly change their plans because something more interesting came up."
            ],
            "Defying the Rules": [
                "Virtuosos will come to learn that many other personality types have much more firmly drawn lines on rules and acceptable behavior than they do – they don’t want to hear an insensitive joke, and certainly wouldn’t tell one back, and they wouldn’t want to engage in horseplay, even with a willing party. If a situation is already emotionally charged, violating these boundaries can backfire tremendously.",
                "Virtuosos have a particular difficulty in predicting emotions, but this is just a natural extension of their fairness, given how difficult it is to gauge Virtuosos’ emotions and motivations. However, their tendency to explore their relationships through their actions rather than through empathy can lead to some very frustrating situations. People with the Virtuoso personality type struggle with boundaries and guidelines, preferring the freedom to move about and color outside the lines if they need to.",
                "Finding an environment where they can work with good friends who understand their style and unpredictability, combining their creativity, sense of humor and hands-on approach to build practical solutions and things, will give Virtuosos many happy years of building useful boxes – and admiring them from the outside."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Olivia_Wilde.png",
                "name": "Olivia Wilde",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Bear_Grylls.png",
                "name": "Bear Grylls",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michael_Jordan.png",
                "name": "Michael Jordan",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Clint_Eastwood.png",
                "name": "Clint Eastwood",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Milla_Jovovich.png",
                "name": "Milla Jovovich",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Daniel_Craig.png",
                "name": "Daniel Craig",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Tom_Cruise.png",
                "name": "Tom Cruise",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michelle_Rodriguez.png",
                "name": "Michelle Rodriguez",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Arya_Stark.png",
                "name": "Arya Stark",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michael_Westen.png",
                "name": "Michael Westen",
                "fictional": 1,
                "movie": "Burn Notice",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Indiana_Jones.png",
                "name": "Indiana Jones",
                "fictional": 1,
                "movie": "Indiana Jones series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Hawkeye.png",
                "name": "Hawkeye",
                "fictional": 1,
                "movie": "Avengers",
                "article": "/articles/hawkeye-the-rogue-archer-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Jack_Bauer.png",
                "name": "Jack Bauer",
                "fictional": 1,
                "movie": "24",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/John_McClane.png",
                "name": "John McClane",
                "fictional": 1,
                "movie": "Die Hard series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Angus_MacGyver.png",
                "name": "Angus MacGyver",
                "fictional": 1,
                "movie": "MacGyver",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lisbeth_Salander.png",
                "name": "Lisbeth Salander",
                "fictional": 1,
                "movie": "The Girl with the Dragon Tattoo",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/James_Bond.png",
                "name": "James Bond",
                "fictional": 1,
                "movie": "Bond series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jessica_Jones.png",
                "name": "Jessica Jones",
                "fictional": 1,
                "movie": "Jessica Jones",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Optimistic and Energetic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Virtuosos are usually up to their elbows in some project or other. Cheerful and good-natured, people with the Virtuoso personality type (especially Assertive ones) rarely get stressed out, preferring to go with the flow."
                },
                "Creative and Practical": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Virtuosos are very imaginative when it comes to practical things, mechanics, and crafts. Novel ideas come easily, and they love using their hands to put them into action."
                },
                "Spontaneous and Rational": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Combining spontaneity with logic, Virtuosos can switch mindsets to fit new situations with little effort, making them flexible and versatile individuals."
                },
                "Know How to Prioritize": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "This flexibility comes with some unpredictability, but Virtuoso personalities are able to store their spontaneity for a rainy day, releasing their energy just when it’s needed most."
                },
                "Great in a Crisis": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "With all this hands-on creativity and spontaneity, it’s no wonder that Virtuosos are naturals in crisis situations. People with this personality type usually enjoy a little physical risk, and they aren’t afraid to get their hands dirty when the situation calls for it."
                },
                "Relaxed": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Through all this, Virtuosos are able to stay quite relaxed. They live in the moment and go with the flow, refusing to worry too much about the future."
                    }
                },
            "weaknesses": {
                "Stubborn": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "As easily as Virtuosos go with the flow, they can also ignore it entirely, and usually move in another direction with little apology or sensitivity. If someone tries to change Virtuosos’ habits, lifestyle or ideas through criticism, they can become quite blunt in their irritation."
                },
                "Insensitive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Virtuosos use logic, and even when they try to meet others halfway with empathy and emotional sensitivity, it rarely seems to quite come out right, if anything is even said at all."
                },
                "Private and Reserved": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Virtuoso personalities are notoriously difficult to get to know. They are true introverts, keeping their personal matters to themselves, and often just prefer silence to small talk."
                },
                "Easily Bored": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Virtuosos enjoy novelty, which makes them excellent tinkerers, but much less reliable when it comes to focusing on things long-term. Once something is understood, Virtuosos tend to simply move on to something new and more interesting."
                },
                "Dislike Commitment": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Long-term commitments are particularly onerous for Virtuosos. They prefer to take things day-by-day, and the feeling of being locked into something for a long time is downright oppressive. This can be a particular challenge in Virtuosos’ romantic relationships."
                },
                "Risky Behavior": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "This stubbornness, difficulty with others’ emotions, focus on the moment, and easy boredom can lead to unnecessary and unhelpful boundary-pushing, just for fun. Virtuosos have been known to escalate conflict and danger just to see where it goes, something that can have disastrous consequences for everyone around if they lose control of the situation."
                    }
                }
        },
        "friendships_sections": {
            "Keeping It Spontaneous": [
                "A lot of this comes down to Virtuosos simply not wanting to be bound to any particular person or activity. Virtuoso personalities live in the present, enjoying whatever life brings, and feel no real obligation to shift course on account of others’ plans. If friends don’t want to do what Virtuosos are doing, then they are free to go do their own thing, and they’ll hang out some other time. Sometimes their shifts in attitude can catch their friends flat-footed, but Virtuosos’ motto remains “everything can be changed”. Forcing them to constantly commit to scheduled activities is probably the quickest way to end these friendships. ",
                "As long as everyone keeps things relaxed and flexible though, Virtuosos’ friendships can be rich and rewarding. People with this personality type are talented when it comes to using their senses, and usually enjoy a little competition. This makes Virtuosos’ hobbies, especially the more physical activities like fishing and crafts, especially enjoyable with a little company, and they are usually the basis for their friendships. Virtuosos’ interests are pretty diverse, so they should have no trouble coming up with exciting things to do.",
                "Virtuoso personalities are also thoughtful, rational people. Being fairly creative individuals themselves, they often enjoy discussing new ideas – but in the end, the point of sharing those ideas needs to be to take action. Dreaming is well and good, but talk is cheap, and discussions on abstract or distant subjects like Eurasian politics can only hold Virtuosos’ attention for so long before they decide to shift their focus to something they can do. ",
                "This makes friendships with Intuitive (N) types, who have a much less physical approach to life, challenging for Virtuosos to maintain. With their enjoyment of firsthand experience, these personalities just feel more comfortable alongside other personality types with the Observant (S) trait. So long as they share a hobby, philosophical differences and contrasting world views really don’t matter too much – it’s what people do that matters to Virtuosos."
            ],
            "The Surprising Charm of Being Yourself": [
                "Virtuosos are unusually popular, almost in spite of themselves. Their open-mindedness, interesting hobbies and relaxed attitude are attractive to a remarkably broad range of personality types. With so many acquaintances, Virtuosos are sure to strike up deeper friendships with at least a few."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/istp-virtuoso.svg?v=2",
            "phrase": "Bold and practical experimenters, masters of all kinds of tools.",
            "link": "https://www.16personalities.com/istp-personality",
            "type": "Virtuoso"
        }
    },
    "ISFP": {
        "intro_pars": [
            "An Adventurer (ISFP) is a person with the Introverted, Observant, Feeling, and Prospecting personality traits. They tend to have open minds, approaching life, new experiences, and people with grounded warmth. Their ability to stay in the moment helps them uncover exciting potentials.",
            "Adventurers are true artists – although not necessarily in the conventional sense. For this personality type, life itself is a canvas for self-expression. From what they wear to how they spend their free time, Adventurers act in ways that vividly reflect who they are as unique individuals.",
            "And every Adventurer is certainly unique. Driven by curiosity and eager to try new things, people with this personality often have a fascinating array of passions and interests. With their exploratory spirits and their ability to find joy in everyday life, Adventurers can be among the most interesting people you’ll ever meet. The only irony? Unassuming and humble, Adventurers tend to see themselves as “just doing their own thing,” so they may not even realize how remarkable they really are."
        ],
        "intro_sections": {
            "The Beauty of an Open Mind": [
                "Adventurers embrace a flexible, adaptable approach to life. Some personality types thrive on strict schedules and routines – but not Adventurers. Adventurers take each day as it comes, doing what feels right to them in the moment. And they make sure to leave plenty of room in their lives for the unexpected – with the result that many of their most cherished memories are of spontaneous, spur-of-the-moment outings and adventures, whether by themselves or with their loved ones.",
                "This flexible mindset makes Adventurers remarkably tolerant and open-minded. These personalities genuinely love living in a world filled with all kinds of people – even people who disagree with them or choose radically different lifestyles. It’s no surprise, then, that Adventurers are unusually open to changing their minds and rethinking their opinions. If any personality type believes in giving something (or someone) a second chance, it’s Adventurers.",
                "That said, Adventurers’ go-with-the-flow mentality can have its downsides. People with this personality type may struggle to set long-term plans – let alone stick with them. As a result, Adventurers tend to have a pretty cloudy view of their ability to achieve their goals, and they often worry about letting other people down. Adventurers may find that adding a little structure to their lives goes a long way toward helping them feel more capable and organized – without quashing their independent spirits."
            ],
            "Living in Harmony": [
                "In their relationships, Adventurers are warm, friendly, and caring, taking wholehearted enjoyment in the company of their nearest and dearest. But make no mistake: this is an Introverted personality type, meaning that Adventurers need dedicated alone time to recharge their energy after socializing with others. This alone time is what allows Adventurers to reestablish a sense of their own identity – in other words, to reconnect with who they truly are.",
                "Creative and free-spirited, Adventurers march to the beat of their own drum, and it would be easy to assume that they don’t particularly worry what other people think of them. But this isn’t the case – Adventurers are thoughtful and perceptive, able to pick up on people’s unspoken feelings and opinions, and it can upset them if they don’t feel liked, approved of, or appreciated. When faced with criticism, it can be a challenge for people with this personality type not to get caught up in the heat of the moment. If they encounter harsh or seemingly unfair criticism, they may even lose their tempers in spectacular fashion.",
                "But there’s good news, too: Adventurers live in the present, and they know that they don’t need to dwell on past hurts or frustrations. Rather than focusing on how things could be different, people with this personality type have an incredible capacity for appreciating what’s right about life just as it is. Everywhere they look, Adventurers can find sources of beauty and enjoyment that other people might miss – and this perspective is just one of the many gifts that they share with the world."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Lana_Del_Rey.png",
                "name": "Lana Del Rey",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jungkook_(Jeon_Jungkook).png",
                "name": "Jungkook (Jeon Jungkook)",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Avril_Lavigne.png",
                "name": "Avril Lavigne",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Kevin_Costner.png",
                "name": "Kevin Costner",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Frida_Kahlo.png",
                "name": "Frida Kahlo",
                "fictional": 0,
                "movie": "",
                "article": "/articles/frida-kahlo-the-fiercest-adventurer"
            },
            {
                "avatar": "./assets/celebrities/Britney_Spears.png",
                "name": "Britney Spears",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michael_Jackson.png",
                "name": "Michael Jackson",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jessica_Alba.png",
                "name": "Jessica Alba",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Joss_Stone.png",
                "name": "Joss Stone",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Beatrix_Kiddo.png",
                "name": "Beatrix Kiddo",
                "fictional": 1,
                "movie": "Kill Bill",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jesse_Pinkman.png",
                "name": "Jesse Pinkman",
                "fictional": 1,
                "movie": "Breaking Bad",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/u00c9owyn.png",
                "name": "u00c9owyn",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": "/articles/eowyn-a-fearless-female-warrior-the-lord-of-the-rings-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Kate_Austen.png",
                "name": "Kate Austen",
                "fictional": 1,
                "movie": "Lost",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Claire_Littleton.png",
                "name": "Claire Littleton",
                "fictional": 1,
                "movie": "Lost",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Hugo_Reyes_(u201cHurleyu201d).png",
                "name": "Hugo Reyes (u201cHurleyu201d)",
                "fictional": 1,
                "movie": "Lost",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Thea_Queen.png",
                "name": "Thea Queen",
                "fictional": 1,
                "movie": "Arrow",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Remy_Hadley_(u201cThirteenu201d).png",
                "name": "Remy Hadley (u201cThirteenu201d)",
                "fictional": 1,
                "movie": "House M.D.",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Edith_Crawley.png",
                "name": "Edith Crawley",
                "fictional": 1,
                "movie": "Downton Abbey",
                "article": "/articles/the-forceful-personality-types-of-downton-abbey"
            }
        ],
        "strengths": {
            "strengths": {
                "Charming": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "People with the Adventurer personality type are relaxed and warm, and their “live and let live” attitude naturally makes them likable and popular. "
                },
                "Sensitive to Others": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Adventurers easily relate to others’ emotions, helping them to establish harmony and good will, and minimize conflict."
                },
                "Imaginative": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Being so aware of others’ emotions, Adventurer personalities use creativity and insight to craft bold ideas that speak to people’s hearts. While it’s hard to explain this quality on a resume, this vivid imagination and exploratory spirit help Adventurers in unexpected ways."
                },
                "Passionate": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Beneath Adventurers’ quiet shyness beats an intensely feeling heart. When people with this personality type are caught up in something exciting and interesting, they can leave everything else in the dust."
                },
                "Curious": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Ideas are well and good, but Adventurers need to see and explore for themselves whether their ideas ring true. Work revolving around the sciences may seem a poor match for their traits, but a boldly artistic and humanistic vision is often exactly what research needs to move forward – if Adventurers are given the freedom they need to do so."
                },
                "Artistic": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Adventurers are able to show their creativity in tangible ways and with stunning beauty. Whether writing a song, painting an emotion, or presenting a statistic in a graph, Adventurers have a way of visualizing things that resonates with their audience."
                    }
                },
            "weaknesses": {
                "Fiercely Independent": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Freedom of expression is often Adventurers’ top priority. Anything that interferes with that, like traditions and hard rules, creates a sense of oppression for Adventurer personalities. This can make more rigidly structured academics and work a challenge."
                },
                "Unpredictable": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Adventurers’ dislike long-term commitments and plans. The tendency to actively avoid planning for the future can cause strain in Adventurers’ romantic relationships and financial hardship later in life."
                },
                "Easily Stressed": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Adventurers live in the present, full of emotion. When situations get out of control, people with this personality type (especially Turbulent ones) can shut down, losing their characteristic charm and creativity in favor of gnashing teeth."
                },
                "Overly Competitive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Adventurers can escalate small things into intense competitions, turning down long-term success in their search for glory in the moment, and are unhappy when they lose."
                },
                "Fluctuating Self-Esteem":  {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description":"It’s demanded that skills be quantified, but that’s hard to do with Adventurers’ strengths of sensitivity and artistry. Adventurers’ efforts are often dismissed, a hurtful and damaging blow, especially early in life. Adventurers can start to believe the naysayers without strong support."
                    }
                }
        },
        "friendships_sections": {
            "Enjoying Life Together": [
                "Adventurer personalities believe in actions, not words. They talk about what is, not what could, should or will be, and then they actually do it. This passion for action is a blessing for Adventurers, since it helps them get past their shyness in meeting new people. Adventurers are sensitive, much more so than most, and it takes time to build enough trust with new friends to open up and feel natural.",
                "If new acquaintances start things out by explaining “You’d do way better if...”, it’s unlikely they will ever be close – Adventurers just take these remarks too personally for comfort. People with this personality type are happy to get along with just about anyone, but potential friends need to ease up on being too judgmental or demanding.",
                "If their friends keep things supportive and easy-going, Adventurers are happy to return the favor with added warmth and laughter. When they’re with friends they trust, Adventurers know how to relax, shedding rules, traditions and expectations in favor of just enjoying themselves.",
                "Those who prefer safe, structured environments might end up struggling in these friendships though, especially if they lecture Adventurers on how they’re living their lives. As with any criticism, those friends are free to do their own thing, and to leave Adventurers to do theirs.",
                "Lots of personal space and freedom are essential to Adventurer personalities, and it’s often other Explorer types, who share their “live and let live” worldview and joy in actually doing things, that gravitate towards Adventurers. There’s really no better friend than Adventurers for dropping the pretenses and enjoying low-stress fun."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/isfp-adventurer.svg?v=2",
            "phrase": "Flexible and charming artists, always ready to explore and experience something new.",
            "link": "https://www.16personalities.com/isfp-personality",
            "type": "Adventurer"
        }
    },
    "ESTP": {
        "intro_pars": [
            "An Entrepreneur (ESTP) is someone with the Extraverted, Observant, Thinking, and Prospecting personality traits. They tend to be energetic and action-oriented, deftly navigating whatever is in front of them. They love uncovering life’s opportunities, whether socializing with others or in more personal pursuits.",
            "Entrepreneurs always have an impact on their immediate surroundings – the best way to spot them at a party is to look for the whirling eddy of people flitting about them as they move from group to group. Laughing and entertaining with a blunt and earthy humor, Entrepreneur personalities love to be the center of attention. If an audience member is asked to come on stage, Entrepreneurs volunteer – or volunteer a shy friend.",
            "Theory, abstract concepts and plodding discussions about global issues and their implications don’t keep Entrepreneurs interested for long. Entrepreneurs keep their conversation energetic, with a good dose of intelligence, but they like to talk about what is – or better yet, to just go out and do it. Entrepreneurs leap before they look, fixing their mistakes as they go, rather than sitting idle, preparing contingencies and escape clauses."
        ],
        "intro_sections": {
            "Diving Right In": [
                "Entrepreneurs are the likeliest personality type to make a lifestyle of risky behavior. They live in the moment and dive into the action – they are the eye of the storm. People with the Entrepreneur personality type enjoy drama, passion, and pleasure, not for emotional thrills, but because it’s so stimulating to their logical minds. They are forced to make critical decisions based on factual, immediate reality in a process of rapid-fire rational stimulus response.",
                "This makes school and other highly organized environments a challenge for Entrepreneurs. It certainly isn’t because they aren’t smart, and they can do well, but the regimented, lecturing approach of formal education is just so far from the hands-on learning that Entrepreneurs enjoy. It takes a great deal of maturity to see this process as a necessary means to an end, something that creates more exciting opportunities.",
                "Also challenging is that to Entrepreneurs, it makes more sense to use their own moral compass than someone else’s. Rules were made to be broken. This is a sentiment few high school instructors or corporate supervisors are likely to share, and can earn Entrepreneur personalities a certain reputation. But if they minimize the trouble-making, harness their energy, and focus through the boring stuff, Entrepreneurs are a force to be reckoned with."
            ],
            "The Path Less Traveled": [
                "With perhaps the most perceptive, unfiltered view of any type, Entrepreneurs have a unique skill in noticing small changes. Whether a shift in facial expression, a new clothing style, or a broken habit, people with this personality type pick up on hidden thoughts and motives where most types would be lucky to pick up anything specific at all. Entrepreneurs use these observations immediately, calling out the change and asking questions, often with little regard for sensitivity. Entrepreneurs should remember that not everyone wants their secrets and decisions broadcast.",
                "If Entrepreneurs aren’t careful though, they may get too caught in the moment, take things too far, and run roughshod over more sensitive people, or forget to take care of their own health and safety. Making up only four percent of the population, there are just enough Entrepreneurs out there to keep things spicy and competitive, and not so many as to cause a systemic risk.",
                "Entrepreneurs are full of passion and energy, complemented by a rational, if sometimes distracted, mind. Inspiring, convincing and colorful, they are natural group leaders, pulling everyone along the path less traveled, bringing life and excitement everywhere they go. Putting these qualities to a constructive and rewarding end is Entrepreneurs’ true challenge."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Ernest_Hemingway.png",
                "name": "Ernest Hemingway",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jack_Nicholson.png",
                "name": "Jack Nicholson",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Eddie_Murphy.png",
                "name": "Eddie Murphy",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Madonna.png",
                "name": "Madonna",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Bruce_Willis.png",
                "name": "Bruce Willis",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Michael_J._Fox.png",
                "name": "Michael J. Fox",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Nicolas_Sarkozy.png",
                "name": "Nicolas Sarkozy",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Samuel_L._Jackson.png",
                "name": "Samuel L. Jackson",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jaime_Lannister.png",
                "name": "Jaime Lannister",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Hank_Schrader.png",
                "name": "Hank Schrader",
                "fictional": 1,
                "movie": "Breaking Bad",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lincoln_Burrows.png",
                "name": "Lincoln Burrows",
                "fictional": 1,
                "movie": "Prison Break",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Seth_Grayson.png",
                "name": "Seth Grayson",
                "fictional": 1,
                "movie": "House of Cards",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Gabrielle_Solis.png",
                "name": "Gabrielle Solis",
                "fictional": 1,
                "movie": "Desperate Housewives",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Fiona_Glenanne.png",
                "name": "Fiona Glenanne",
                "fictional": 1,
                "movie": "Burn Notice",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Rocket.png",
                "name": "Rocket",
                "fictional": 1,
                "movie": "Avengers",
                "article": "/articles/rocket-not-just-a-raccoon-with-a-machine-gun-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Ant-Man.png",
                "name": "Ant-Man",
                "fictional": 1,
                "movie": "Avengers",
                "article": "/articles/ant-man-an-ant-size-superhero-with-a-large-personality-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/D'Artagnan.png",
                "name": "D'Artagnan",
                "fictional": 1,
                "movie": "The Three Musketeers",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Philip_Wenneck.png",
                "name": "Philip Wenneck",
                "fictional": 1,
                "movie": "Hangover",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Bold": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "People with the Entrepreneur personality type are full of life and energy. There is no greater joy for Entrepreneurs than pushing boundaries and discovering and using new things and ideas."
                },
                "Rational and Practical": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Entrepreneurs love knowledge and philosophy, but not for their own sake. What’s fun for Entrepreneur personalities is finding ideas that are actionable and drilling into the details so they can put them to use. If a discussion is completely arbitrary, there are better uses for Entrepreneurs’ time."
                },
                "Original": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Combining their boldness and practicality, Entrepreneurs love to experiment with new ideas and solutions. They put things together in ways no one else would think to."
                },
                "Perceptive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "This originality is helped by Entrepreneurs’ ability to notice when things change – and when they need to change! Small shifts in habits and appearances stick out to Entrepreneurs, and they use these observations to help create connections with others."
                },
                "Direct": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "This perceptive skill isn’t used for mind games – Entrepreneurs prefer to communicate clearly, with direct and factual questions and answers. Things are what they are."
                },
                "Sociable": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "All these qualities pull together to make a natural group leader in Entrepreneurs. This isn’t something that they actively seek – people with this personality type just have a knack for making excellent use of social interactions and networking opportunities."
                    }
                },
            "weaknesses": {
                "Insensitive": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Feelings and emotions come second to facts and “reality” for Entrepreneurs. Emotionally charged situations are awkward, uncomfortable affairs, and Entrepreneurs’ blunt honesty doesn’t help here. These personalities often have a lot of trouble acknowledging and expressing their own feelings as well."
                },
                "Impatient": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Entrepreneurs move at their own pace to keep themselves excited. Slowing down because someone else “doesn’t get it” or having to stay focused on a single detail for too long is extremely challenging for Entrepreneurs."
                },
                "Risk-prone": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "This impatience can lead Entrepreneurs to push into uncharted territory without thinking of the long-term consequences. Entrepreneur personalities sometimes intentionally combat boredom with extra risk."
                },
                "Unstructured": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Entrepreneurs see an opportunity – to fix a problem, to advance, to have fun – and seize the moment, often ignoring rules and social expectations in the process. This may get things done, but it can create unexpected social fallout."
                },
                "May Miss the Bigger Picture": {
                    "image": "./assets/strength_weaknesses/006-original.png",
                    "description": "Living in the moment can cause Entrepreneurs to miss the forest for the trees. People with this personality type love to solve problems here and now, perhaps too much. All parts of a project can be perfect, but the project will still fail if those parts do not fit together."
                },
                "Defiant": {
                "image": "./assets/strength_weaknesses/006-original.png",
                "description": "Entrepreneurs won’t be boxed in. Repetition, hardline rules, sitting quietly while they are lectured at – this isn’t how Entrepreneurs live their lives. They are action-oriented and hands-on. Environments like school and much entry-level work can be so tedious that they’re intolerable, requiring extraordinary effort from Entrepreneurs to stay focused long enough to get to freer positions."
                    }
                }
        },
        "friendships_sections": {
            "A Zest for Life": [
                "Hands-on, physical activities like team sports are Entrepreneurs’ idea of fun, and these environments give them plenty of chances to make new friends. There is little difficulty for Entrepreneurs here – they seem to get along with just about everyone, and make new friends wherever they go. Entrepreneurs live in the moment, and as a naturally confident personality type (especially if they are Assertive as well), they don’t worry much about what others think of them. This attracts friends who share their attitude and zest for life.",
                "While not opposed to long philosophical discussions, and often enjoying the intellectual exercise, Entrepreneurs are unlikely to develop friendships based solely around one-on-one discussions about European economic challenges and the role of religion in politics. Straightforward to the point of being blunt, Entrepreneurs call it like they see it, and an honest opinion in debate is a sure thing. But at their hearts, Entrepreneurs are people of action, preferring to do what can be done than to talk about what might someday be."
            ],
            "Adventure Awaits": [
                "Exploration, excitement, adrenaline and risk – Entrepreneurs’ friends should be prepared for all of these things. Often enough they’re happy to perform for the crowd, but they also tend to encourage their friends to join in. Most personality types might take “thanks but no thanks” personally, but Entrepreneurs are comfortable with who they are, and are more likely to just shrug their shoulders and move on with those friends who are game for adventure."
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/estp-entrepreneur.svg?v=2",
            "phrase": "Smart, energetic and very perceptive people, who truly enjoy living on the edge.",
            "link": "https://www.16personalities.com/estp-personality",
            "type": "Entrepreneur"
        }
    },
    "ESFP": {
        "intro_pars": [
            "An Entertainer (ESFP) is a person with the Extraverted, Observant, Feeling, and Prospecting personality traits. These people love vibrant experiences, engaging in life eagerly and taking pleasure in discovering the unknown. They can be very social, often encouraging others into shared activities.",
            "If anyone is to be found spontaneously breaking into song and dance, it is the Entertainer personality type. Entertainers get caught up in the excitement of the moment, and want everyone else to feel that way, too. No other personality type is as generous with their time and energy as Entertainers when it comes to encouraging others, and no other personality type does it with such irresistible style."
        ],
        "intro_sections": {
            "Living with Passion": [
                "Entertainers love the spotlight, and all the world’s a stage. Many famous people with the Entertainer personality type are indeed actors, but they love putting on a show for their friends too, chatting with a unique and earthy wit, soaking up attention and making every outing feel a bit like a party. Utterly social, Entertainers enjoy the simplest things, and there’s no greater joy for them than just having fun with a good group of friends.",
                "It’s not just talk either – Entertainers have the strongest aesthetic sense of any personality type. From grooming and outfits to a well-appointed home, Entertainer personalities have an eye for fashion. Knowing what’s attractive the moment they see it, Entertainers aren’t afraid to change their surroundings to reflect their personal style. Entertainers are naturally curious, exploring new designs and styles with ease.",
                "Though it may not always seem like it, Entertainers know that it’s not all about them – they are observant, and very sensitive to others’ emotions. People with this personality type are often the first to help someone talk out a challenging problem, happily providing emotional support and practical advice. However, if the problem is about them, Entertainers are more likely to avoid a conflict altogether than to address it head-on. Entertainers usually love a little drama and passion, but not so much when they are the focus of the criticisms it can bring."
            ],
            "A Spontaneous Spirit": [
                "The biggest challenge Entertainers face is that they are often so focused on immediate pleasures that they neglect the duties and responsibilities that make those luxuries possible. Complex analysis, repetitive tasks, and matching statistics to real consequences are not easy activities for Entertainers. They’d rather rely on luck or opportunity, or simply ask for help from their extensive circle of friends. It is important for Entertainers to challenge themselves to keep track of long-term things like their retirement plans or sugar intake – there won’t always be someone else around who can help to keep an eye on these things.",
                "Entertainers recognize value and quality, which on its own is a fine trait. In combination with their tendency to be poor planners though, this can cause them to live beyond their means, and credit cards are especially dangerous. More focused on leaping at opportunities than in planning out long-term goals, Entertainers may find that their inattentiveness has made some activities unaffordable.",
                "Entertainers are welcome wherever there’s a need for laughter, playfulness, and a volunteer to try something new and fun – and there’s no greater joy for Entertainer personalities than to bring everyone else along for the ride. Entertainers can chat for hours, sometimes about anything but the topic they meant to talk about, and share their loved ones’ emotions through good times and bad. If they can just remember to keep their ducks in a row, they’ll always be ready to dive into all the new and exciting things the world has to offer, friends in tow."
            ]
        },
        "celebrities": [
            {
                "avatar": "./assets/celebrities/Elton_John.png",
                "name": "Elton John",
                "fictional": 0,
                "movie": "",
                "article": "/articles/elton-john-flamboyant-entertainer-and-music-legend"
            },
            {
                "avatar": "./assets/celebrities/Marilyn_Monroe.png",
                "name": "Marilyn Monroe",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jamie_Oliver.png",
                "name": "Jamie Oliver",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Adele.png",
                "name": "Adele",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jamie_Foxx.png",
                "name": "Jamie Foxx",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Steve_Irwin.png",
                "name": "Steve Irwin",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Miley_Cyrus.png",
                "name": "Miley Cyrus",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Adam_Levine.png",
                "name": "Adam Levine",
                "fictional": 0,
                "movie": "",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Dandelion.png",
                "name": "Dandelion",
                "fictional": 1,
                "movie": "The Witcher series",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Ygritte.png",
                "name": "Ygritte",
                "fictional": 1,
                "movie": "Game of Thrones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Penny.png",
                "name": "Penny",
                "fictional": 1,
                "movie": "The Big Bang Theory",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Captain_Marvel.png",
                "name": "Captain Marvel",
                "fictional": 1,
                "movie": "Captain Marvel",
                "article": "/articles/captain-marvel-a-passionate-personality-avengers-personality-series"
            },
            {
                "avatar": "./assets/celebrities/Angela_Montenegro.png",
                "name": "Angela Montenegro",
                "fictional": 1,
                "movie": "Bones",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Peregrin_Took.png",
                "name": "Peregrin Took",
                "fictional": 1,
                "movie": "The Lord of the Rings",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Gob_Bluth.png",
                "name": "Gob Bluth",
                "fictional": 1,
                "movie": "Arrested Development",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Lindsay_Bluth_Fu00fcnke.png",
                "name": "Lindsay Bluth Fu00fcnke",
                "fictional": 1,
                "movie": "Arrested Development",
                "article": ""
            },
            {
                "avatar": "./assets/celebrities/Jack_Dawson.png",
                "name": "Jack Dawson",
                "fictional": 1,
                "movie": "Titanic",
                "article": ""
            }
        ],
        "strengths": {
            "strengths": {
                "Bold": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "Entertainers aren’t known for holding back. Wanting to experience everything there is to experience, people with the Entertainer personality type don’t mind stepping out of their comfort zones when no one else is willing."
                },
                "Original": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "Traditions and expectations are secondary to Entertainers, if a consideration at all. Entertainer personalities love to experiment with new styles, and constantly find new ways to stick out in the crowd."
                },
                "Aesthetics and Showmanship": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description":"Not stopping at mere outfits, Entertainers inject artistic creativity into their words and actions, too. Every day is a performance, and Entertainers love to put on a show."
                },
                "Practical":{
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "To Entertainers, the world is meant to be felt and experienced. Truth is stranger than fiction, and Entertainers prefer to see and do than to wax philosophical about “what-ifs”."
                },
                "Observant":{
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "With all this focus on the here and now, on doing and acting, it makes sense that Entertainers are naturals when it comes to noticing real, tangible things and changes."
                },
                "Excellent People Skills":{
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "More so than things though, Entertainers love to pay attention to people. They are talkative, witty, and almost never run out of things to discuss. For people with this personality type, happiness and satisfaction stem from the time they spend with the people they enjoy being with."
            }
        },
            "weaknesses": {
                "Sensitive":{
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "Entertainers (especially Turbulent ones) are strongly emotional, and very vulnerable to criticism – they can feel like they’ve been backed into a corner, sometimes reacting badly. This is probably Entertainers’ greatest weakness, because it makes it so hard to address any other weaknesses brought to light."
                },
                "Conflict-Averse": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description":"Entertainers sometimes ignore and avoid conflict entirely. They tend to say and do what’s needed to get out of such situations, then move on to something more fun."
                },
                "Easily Bored": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description":"Without constant excitement, Entertainers find ways to create it themselves. Risky behavior, self-indulgence, and the pleasures of the moment over long-term plans are all things Entertainers get into a little too often."
                },
                "Poor Long-Term Planners":{
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description": "In fact, Entertainer personalities rarely make detailed plans for the future. To them, things come as they come, and they rarely bother with taking the time to lay out steps and consequences, with the belief that they could change at any moment – even with things that can be planned."
                },
                "Unfocused ": {
                    "image":  "./assets/strength_weaknesses/001-clock.png",
                    "description":"Anything that requires long-term dedication and focus is a particular challenge for Entertainers. In academics, dense, unchanging subjects like Classic Literature are much more difficult than more dynamic, relatable subjects like psychology. The trick for Entertainers is to find day-to-day joy in broader goals, and to tough it out with those tedious things that must be done."
                    }
                }
        },
        
        "friendships_sections": {
            "Making Life Interesting": [
                "Entertainers are people of action. Getting out with activities that engage all five senses is Entertainer personalities’ idea of a good time. Sometimes though, Entertainers may go too far with risky or careless behaviors, and try to bring others along for the ride. People with this personality type are sensitive, and rejecting these pastimes can be taken personally, ending friendships then and there. Entertainers don’t have time to be lectured.",
                "Making new friends isn’t a problem for Entertainers though – they use an alluring combination of blunt truths and disarming openness and charm to keep things moving. Where Entertainer personalities falter is in keeping the friends they already have. In their excitement and focus on here and now over history, Entertainers too easily exhaust the adventure one person has to offer, moving on once one person’s novelty has worn off.",
                "This can all give the impression that Entertainers are shallow, pleasure-centric creatures who care little for anyone but themselves. This is a terrible misunderstanding, and far from the truth, but nevertheless makes friendships with Intuitive (N) personality types challenging. Entertainers care sincerely about their friends – it’s why they put so much effort into coming up with group experiences they believe everyone will enjoy – and they are deeply distressed by the occasional conflicts that end these relationships.",
                "Novelty is king for people with the Entertainer personality type, and there’s only so much diversity among fellow Explorer types. Entertainers love touching on intellectual and philosophical subjects, and they seek out a diversity of personality types and perspectives to keep among their friends. But as these friends grind into the details of some esoteric topic about the long-term consequences of faltering European economic output, Entertainers inevitably find their minds wandering, hoping for someone to rush up and say “Guess what just happened!”"
            ]
        },
        "data": {
            "image": "https://www.16personalities.com/static/images/personality-types/avatars/esfp-entertainer.svg?v=2",
            "phrase": "Spontaneous, energetic and enthusiastic people – life is never boring around them.",
            "link": "https://www.16personalities.com/esfp-personality",
            "type": "Entertainer"
            }
        }
    }


